using System;
using System.Web.UI;
using Chandam.Core;


public partial class Yati : System.Web.UI.Page
{
	protected void Page_Load (object sender , EventArgs e)
	{
		//if (! Page.IsPostBack )
		//{
		//    TextBox1.Text = "ర్జర్జ";
		//    TextBox2.Text = "ర్జ";
		//    return;
		//}
		//result.InnerHtml = new Library.Extensions.YatiPrasaTester ( ).CheckPrasa ( p1,p2, false );
		//string h="";
		//string k="పు పూ బు బూ పొ పో బొ బో ము మూ మొ మో";
		//"పు , మూ, పు , మొ, ము , పూ,పూ , మొ,పూ , మో"
		//foreach ( string p1 in k.Split ( ' ' ) )
		//{
		//    foreach ( string p2 in k.Split ( ' ' ) )
		//    {

		//        h = h + new Library.Extensions.YatiPrasaTester ( ).CheckYati ( p1 , p2 , false ) +
		//            "<br/>" +
		//            new Library.Extensions.YatiPrasaTester ( ).CheckYati ( p2 , p1 , false ) +
		//            "<br/>";
		//    }
		//}
		//result.InnerHtml = h;

		result.InnerHtml = new Chandam.Extensions.YatiPrasaTester().CheckYati("ద", "దై", false)
		+ "<br/>" + new Chandam.Extensions.YatiPrasaTester().CheckYati("ద", "దై", false);


		//string g=	new Library.Extensions.YatiPrasaTester ( ).CheckYati ( "పు" , "మూ" , false );
		//result.InnerHtml = g;

	}
	private bool PrasaCheck (string s1 , string s2)
	{
		YatiPrasaChecker2 Y= new YatiPrasaChecker2 ( );
		bool f=Y.IsPrasaMatched ( s1 , s2 );
		return f;
	}
	private bool YatiCheck (string s1 , string s2 , bool Sandhi)
	{
		YatiPrasaChecker2 Y= new YatiPrasaChecker2 ( );
		Y.SoundexSandhi = Sandhi;
		bool f=Y.IsYatiMatched ( s1 , s2 );
		return f;
	}
	private string Build (string[][] M)
	{
		string S=" ";
		YatiPrasaChecker2 Y= new YatiPrasaChecker2 ( );
		foreach ( string[] s in M )
		{
			{
				bool f=Y.IsYatiMatched ( s[2] , s[3] );
				if ( !f )
				{
					S = S + "<tr" + ( f ? " " : " style='color:red;'" ) + "><td>" + s[0] + "</td><td>" + s[1] + "</td><td>" + s[2] + "</td><td>" + s[3] + "</td><td>" + f.ToString ( ) + "</td></tr>";
				}
			}
			{
				bool f=Y.IsYatiMatched ( s[3] , s[2] );
				if ( !f )
				{
					S = S + "<tr" + ( f ? " " : " style='color:red;'" ) + "><td>" + s[0] + "</td><td>" + s[1] + "</td><td>" + s[3] + "</td><td>" + s[2] + "</td><td>" + f.ToString ( ) + "</td></tr>";
				}
			}

		}
		return S == " " ? "<h2>Perfect</h2>" : "<table>" + S + "</table>";
	}


	protected void YCheck_Click (object sender , EventArgs e)
	{
		GanaVibhajana G1 = new GanaVibhajana ( TextBox1.Text, Chandam.Rules.RuleLanguage.Telugu );
		bool  f=YatiCheck ( TextBox1.Text , TextBox2.Text , false );
		string s=f ? String.Format ( "Yati matached between  <b>{0}</b>  and <b>{1}</b>" , TextBox1.Text , TextBox2.Text ) :
					String.Format ( "Yati <b>Not</b> matached between  <b>{0}</b>  and <b>{1}</b>" , TextBox1.Text , TextBox2.Text );
		result.InnerHtml = s;
	}
	protected void PCheck_Click (object sender , EventArgs e)
	{
		bool  f=PrasaCheck ( TextBox1.Text , TextBox2.Text );
		string s=f ? String.Format ( "Prasa matached between  <b>{0}</b>  and <b>{1}</b>" , TextBox1.Text , TextBox2.Text ) :
					String.Format ( "Prasa <b>Not</b> matached between  <b>{0}</b>  and <b>{1}</b>" , TextBox1.Text , TextBox2.Text );
		result.InnerHtml = s;
	}
}

public class YatiPrasaTester
{
	string[][] Anthya= new string[][] {
new string[] {"వ్యంజన యతులు","అంత్యోష్మ సంధి కళులు","హై","గ్ఘ"},
new string[] {"వ్యంజన యతులు","అంత్యోష్మ సంధి కళులు","హ","డ్ఢ"},
new string[] {"వ్యంజన యతులు","అంత్యోష్మ సంధి కళులు","హ","ద్ధ్రా"},
new string[] {"వ్యంజన యతులు","అంత్యోష్మ సంధి కళులు","హృ","బ్భ"},
 };

	string[][] Rest1= new string[][] { 
new string[] {"వ్యంజన యతులు","అభేద  వర్గ విరతులు","ప","వ"},
new string[] {"వ్యంజన యతులు","అభేద  వర్గ విరతులు","ఫ","వ"},
new string[] {"వ్యంజన యతులు","అభేద  వర్గ విరతులు","బ","వ"},
new string[] {"వ్యంజన యతులు","అభేద  వర్గ విరతులు","భ","వ"},
new string[] {"వ్యంజన యతులు","అభేద  వర్గ విరతులు","న","ణ"},
new string[] {"వ్యంజన యతులు","ఊష్మ విశ్రాంతులు","శ","ష"},
new string[] {"వ్యంజన యతులు","ఊష్మ విశ్రాంతులు","శ","స"},
new string[] {"వ్యంజన యతులు","ఊష్మ విశ్రాంతులు","ష","స"},
new string[] {"వ్యంజన యతులు","సరసయతి ","చ","ఛ"},
new string[] {"వ్యంజన యతులు","సరసయతి ","చ","జ"},
new string[] {"వ్యంజన యతులు","సరసయతి ","చ","ఝ"},
new string[] {"వ్యంజన యతులు","సరసయతి ","చ","శ"},
new string[] {"వ్యంజన యతులు","సరసయతి ","చ","ష"},
new string[] {"వ్యంజన యతులు","సరసయతి ","చ","స"},
};

	string[][] Rest2=new string[][] { 

new string[] {"వ్యంజన యతులు","తద్భవవ్యాజ విశ్రమములు","ఙ్ఞా","నా"},
new string[] {"వ్యంజన యతులు","తద్భవవ్యాజ విశ్రమములు","ఙ్ఞా","ణా"},
new string[] {"వ్యంజన యతులు","తద్భవవ్యాజ విశ్రమములు","ఙ్ఞా","ణ"},
new string[] {"వ్యంజన యతులు","తద్భవవ్యాజ విశ్రమములు","ఙ్ఞా","న"},

new string[] {"వ్యంజన యతులు","విశేషవళి","క","ఙ"},
new string[] {"వ్యంజన యతులు","విశేషవళి","ఖ","ఙ"},
new string[] {"వ్యంజన యతులు","విశేషవళి","గ","ఙ"},
new string[] {"వ్యంజన యతులు","విశేషవళి","ఘ","ఙ"},
new string[] {"వ్యంజన యతులు","అనుస్వార సంబంధ యతులు","ంట","ంత"},
new string[] {"వ్యంజన యతులు","అనుస్వార సంబంధ యతులు","ంట","ంథ"},
new string[] {"వ్యంజన యతులు","అనుస్వార సంబంధ యతులు","ంట","ంద"},
new string[] {"వ్యంజన యతులు","అనుస్వార సంబంధ యతులు","ంట","ంధ"},
new string[] {"వ్యంజన యతులు","అనుస్వార సంబంధ యతులు","ంఠ","ంత"},
new string[] {"వ్యంజన యతులు","అనుస్వార సంబంధ యతులు","ంఠ","ంథ"},
new string[] {"వ్యంజన యతులు","అనుస్వార సంబంధ యతులు","ంఠ","ంద"},
new string[] {"వ్యంజన యతులు","అనుస్వార సంబంధ యతులు","ంఠ","ంధ"},
new string[] {"వ్యంజన యతులు","అనుస్వార సంబంధ యతులు","ండ","ంత"},
new string[] {"వ్యంజన యతులు","అనుస్వార సంబంధ యతులు","ండ","ంథ"},
new string[] {"వ్యంజన యతులు","అనుస్వార సంబంధ యతులు","ండ","ంద"},
new string[] {"వ్యంజన యతులు","అనుస్వార సంబంధ యతులు","ండ","ంధ"},
new string[] {"వ్యంజన యతులు","అనుస్వార సంబంధ యతులు","ంఢ","ంత"},
new string[] {"వ్యంజన యతులు","అనుస్వార సంబంధ యతులు","ంఢ","ంథ"},
new string[] {"వ్యంజన యతులు","అనుస్వార సంబంధ యతులు","ంఢ","ంద"},
new string[] {"వ్యంజన యతులు","అనుస్వార సంబంధ యతులు","ంఢ","ంధ"},
new string[] {"వ్యంజన యతులు","అనునాసికాక్షర యతులు","ంట","న"},
new string[] {"వ్యంజన యతులు","అనునాసికాక్షర యతులు","ంఠ","న"},
new string[] {"వ్యంజన యతులు","అనునాసికాక్షర యతులు","ండ","న"},
new string[] {"వ్యంజన యతులు","అనునాసికాక్షర యతులు","ంఢ","న"},
new string[] {"వ్యంజన యతులు","అనునాసికాక్షర యతులు","ంత","ణ"},
new string[] {"వ్యంజన యతులు","అనునాసికాక్షర యతులు","ంథ","ణ"},
new string[] {"వ్యంజన యతులు","అనునాసికాక్షర యతులు","ంద","ణ"},
new string[] {"వ్యంజన యతులు","అనునాసికాక్షర యతులు","ంధ","ణ"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","పు","ము"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","పూ","ము"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","పొ","ము"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","పో","ము"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","ఫు","ము"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","ఫూ","ము"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","ఫొ","ము"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","ఫో","ము"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","బు","ము"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","బూ","ము"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","బొ","ము"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","బో","ము"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","భు","ము"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","భూ","ము"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","భొ","ము"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","భో","ము"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","మూ","ము"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","మొ","ము"},
new string[] {"వ్యంజన యతులు","మువిభక్తియతి/ముకారయతి ","మో","ము"},
new string[] {"వ్యంజన యతులు","మువర్ణ  విరామం","ంయ","మ"},
new string[] {"వ్యంజన యతులు","మువర్ణ  విరామం","ంర","మ"},
new string[] {"వ్యంజన యతులు","మువర్ణ  విరామం","ంల","మ"},
new string[] {"వ్యంజన యతులు","మువర్ణ  విరామం","ంవ","మ"},
new string[] {"వ్యంజన యతులు","మువర్ణ  విరామం","ంశ","మ"},
new string[] {"వ్యంజన యతులు","మువర్ణ  విరామం","ంస","మ"},
new string[] {"వ్యంజన యతులు","మువర్ణ  విరామం","ంష","మ"},
new string[] {"వ్యంజన యతులు","మువర్ణ  విరామం","ంహ","మ"},
new string[] {"వ్యంజన యతులు","ఋజు యతులు","య","హ"},
new string[] {"వ్యంజన యతులు","ఏకతరయతులు","ర","ఱ"},
new string[] {"వ్యంజన యతులు","అభేద విరతులు","వ","బ"},
new string[] {"వ్యంజన యతులు","అభేద విరతులు","ల","ళ"},
new string[] {"వ్యంజన యతులు","అభేద విరతులు","ల","డ"},
};

	string[][] BinduYatulu= new string[][] { 
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంక","ఙ"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంఖ","ఙ"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంగ","ఙ"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంఘ","ఙ"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంచ","ఞ"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంఛ","ఞ"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంజ","ఞ"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంఝ","ఞ"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంట","ణ"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంఠ","ణ"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ండ","ణ"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంఢ","ణ"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంత","న"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంథ","న"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంద","న"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంధ","న"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంప","మ"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంఫ","మ"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంబ","మ"},
new string[] {"వ్యంజన యతులు","బిందు యతులు","ంభ","మ"},
};

	string[][] VargaYatulu= new string[][] { 
new string[] {"వ్యంజన యతులు","వర్గ జయతులు","కం","ఖం"},
new string[] {"వ్యంజన యతులు","వర్గ జయతులు","ఖం","గా"},
new string[] {"వ్యంజన యతులు","వర్గ జయతులు","గ","ఘ"},
new string[] {"వ్యంజన యతులు","వర్గ జయతులు","భ","వ"},
new string[] {"వ్యంజన యతులు","వర్గ జయతులు","చ","జం"},
new string[] {"వ్యంజన యతులు","వర్గ జయతులు","చి","చిం"},
new string[] {"వ్యంజన యతులు","వర్గ జయతులు","జ","జా"},
new string[] {"వ్యంజన యతులు","వర్గ జయతులు","జ","ఝ"},
};

	string[][] SvaraYati=new string[][]{ 
new string[] {"స్వర యతులు","స్వరమైత్రివళి","అ","ఆ"},
new string[] {"స్వర యతులు","స్వరమైత్రివళి","అ","ఐ"},
new string[] {"స్వర యతులు","స్వరమైత్రివళి","అ","ఔ"},
new string[] {"స్వర యతులు","స్వరమైత్రివళి","ఇ","ఏ"},
new  string[] {"స్వర యతులు","స్వరమైత్రివళి","ఇ","ఋ"},
new string[] {"స్వర యతులు","స్వరమైత్రివళి","ఇ","ౠ"},
new  string[] {"స్వర యతులు","స్వరమైత్రివళి","ఇ","ఎ"},
new  string[] {"స్వర యతులు","స్వరమైత్రివళి","ఇ","ఏ"},
new string[] {"స్వర యతులు","స్వరమైత్రివళి","ఏ","ఋ"},
new string[] {"స్వర యతులు","స్వరమైత్రివళి","ఏ","ౠ"},
new string[] {"స్వర యతులు","స్వరమైత్రివళి","ఏ","ఎ"},
new string[] {"స్వర యతులు","స్వరమైత్రివళి","ఋ","ౠ"},
new string[] {"స్వర యతులు","స్వరమైత్రివళి","ఋ","ఎ"},
new string[] {"స్వర యతులు","స్వరమైత్రివళి","ౠ","ఎ"},
new  string[] {"స్వర యతులు","స్వరమైత్రివళి","ఉ","ఊ"},
new  string[] {"స్వర యతులు","స్వరమైత్రివళి","ఉ","ఒ"},
new  string[] {"స్వర యతులు","స్వరమైత్రివళి","ఉ","ఓ"},
new string[] {"స్వర యతులు","స్వరమైత్రివళి","ఊ","ఒ"},
new string[] {"స్వర యతులు","స్వరమైత్రివళి","ఊ","ఓ"},
new string[] {"స్వర యతులు","స్వరమైత్రివళి","ఒ","ఓ"},
new string[] {"స్వర యతులు","స్వరప్రధానవళి","అ","శా"},
new string[] {"స్వర యతులు","స్వరప్రధానవళి","ఇ","కే"},
new string[] {"స్వర యతులు","స్వరప్రధానవళి","ఉ","తో"},
new string[] {"స్వర యతులు","లుప్తవిసర్గస్వరవళి","అం","రోఽ"},
new string[] {"స్వర యతులు","లుప్తవిసర్గస్వరవళి","యా","మోఽ"},
new string[] {"స్వర యతులు","లుప్తవిసర్గస్వరవళి","హ","న్యోఽ"},
new string[] {"స్వర యతులు","వృద్ధివళి","ఇ","కై"},
new string[] {"స్వర యతులు","వృద్ధివళి","అ","తై "},
new string[] {"స్వర యతులు","వృద్ధివళి","ఉ","క్తౌ"},
new string[] {"స్వర యతులు","వృద్ధివళి","డౌ","య"},
new string[] {"స్వర యతులు","ఋవళి","రే","కృ"},
new string[] {"స్వర యతులు","ఋవళి","ఋ","రిం"},
new string[] {"స్వర యతులు","ఋత్వసంబంధవళి","ఇ","వృ"},
new string[] {"స్వర యతులు","ఋత్వసంబంధవళి","ఋ","కృ"},
new string[] {"స్వర యతులు","ఋత్వసంబంధవళి","నే","ధృ"},
new string[] {"స్వర యతులు","ఋత్వసంబంధవళి","హీ","వృ"},
new string[] {"స్వర యతులు","ౠత్వసౌమ్యవళి","వృ","పృ"},
new string[] {"స్వర యతులు","ౠత్వసౌమ్యవళి","మృ","గృ"},

};

	public string[][] PranaViramamu= new string[][] { 
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","క","కా"},
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","క","కై"},
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","క","కౌ"},
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","కా","కై"},
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","కా","కౌ"},
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","కై","కౌ"},
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","నా","న"},
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","గ","గా"},
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","గే","గ్గి"},
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","గొ","గూ"},
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","చె","చి"},
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","క","కాం"},
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","కి","కీ"},
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","కి","కృ"},
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","కృ","కె"},
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","కె","గే"},
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","గుం","గూ"},
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","కూ","గొ"},
new string[] {"వ్యంజన యతులు","ప్రాణ విరామము","గొ","కో"},
};

}
