//---------------------------------------------------------------------------------------------
// <copyright file="Bhaskara.cs" company="Chandam-ఛందం">
//    Copyright © 2013 - 2018 'Chandam-ఛందం' : http://chandam.apphb.com
//    Original Author : Dileep Miriyala (m.dileep@gmail.com)
//    Last Updated    : 03-Feb-2018 21:34EST
//    Revisions:
//       Version    | Author                   | Email                     | Remarks
//       1.0        | Dileep Miriyala          | m.dileep@gmail.com        | Initial Commit
//       _._        | <TODO>                   |   <TODO>                  | <TODO>
// </copyright>
//---------------------------------------------------------------------------------------------

using Chandam.Samples;

namespace Library.Chandam.Samples
{
	public class Bhaskara : SamplePoems
	{

		public override string[] Poems
		{
			get
			{
				return new string[]
				{
					@"ఒరిగిన వేళ నెంతటి ఘనుండును దన్నొక రొక్క నేర్పుతో
నగపడి ప్రోదిసేయక తనంతట బల్మికిరాడు నిక్కమే;
జగమున నగ్నియైనఁ గడు సన్నగిలంబడియున్న, నింధనం
బెగయెఁగ ద్రోచి యూదక మఱెట్లు రవుల్కొన నేర్చు భాస్కరా!" ,

@"చదువది యెంత గల్గిన రసజ్ఞత యించుక చాలకున్న నా
చదువు నిరర్థకంబు, గుణ సంయుతులెవ్వరు మెచ్చ రెచ్చటం;
బదనుగ మంచికూర నలపాకము చేసిననైన నందు నిం
పొదవెడొ నుప్పు లేక రుచి పుట్టఁగ నేర్చు నటయ్య భాస్కరా!" ,

@"తెలియని కార్యమెల్లఁ గడతేర్చుట కొక్క వివేకి చేకొనన్
వలయు నటైన దిద్దు కొనవచ్చు ప్రయోజన మాంద్య మేమియుం
గలగదు; ఫాలమందుఁ దిలకం బిడు నప్పుడు చేత నద్దముం
గలిగిన చక్కఁ జేసికొను గాదె నరుండది చూచి భాస్కరా!" ,

@"ఉరుగుణవంతుఁ డొండు తనకొండపకారము సేయునప్పుడుం
బరహితమే యొనర్చు నొక పట్టున నైనను గీడుఁ జేయఁ గా
నెఱుఁగడు నిక్కమే కద; యదెట్లనఁ గవ్వము బట్టి యెంతయున్
దరువఁగఁ జొచ్చినం బెరుఁగు తాలిమి నీయదె వెన్న, భాస్కరా!" ,

@"బలయుతుఁ డైన వేళ నిజ బంధుఁడు తోడ్పడుఁ గాని యాతఁడే
బలము తొలంగెనేని తన పాలిటి శత్రు; వదెట్లు పూర్ణుఁడై
జ్వలనుఁడు కానఁ గాల్చు తఱి సఖ్యముఁ జూపును వాయుదేవుఁడా
బలియుఁడు సూక్ష్మదీపమగు పట్టున నార్పదె గాలి భాస్కరా!" ,

@"సన్నుత కార్య దక్షుడొకచాయ నిజప్రభ యప్రకాశమై
యున్నపుడైన లోకులకు నొండొక మేలొపరించు; సత్వ సం
పన్నుడు భీముడా ద్విజుల ప్రాణము కావడె ఏకచక్రమం
దెన్నికగా బకాసురుని నేపున రూపడఁగించి భాస్కరా!" ,

@"పూరిత సద్గుణంబు గల పుణ్యున కించుక రూప సంపదల్
దూరములైన వాని యెడ దొడ్డగ చూతురు బుద్ధిమంతు లె
ట్లారయ; గొగ్గులైన మఱి యందుల మాధురి చూచి కాదె ఖ
ర్జూర ఫలంబులన్ ప్రియము చొప్పడ లోకులు గొంట భాస్కరా!" ,

@"దక్షుడు లేని యింటికిఁ బదార్థము వేఱొక చోటనుండి వే
లక్షలు వచ్చుచుండినఁ బలాయనమై చనుఁ, గల్ల గాదు, ప్ర
త్యక్షము; వాగులున్ వరదలన్నియు వచ్చిన నీరు నిల్చునే
అక్షయమైన గండి తెగినట్టి తటాకములోన భాస్కరా!" ,

@"తనకు ఫలంబు లేదని యెదం దలపోయఁడు కీర్తి గోరు నా
ఘన గుణశాలి లోకహిత కార్యము మిక్కిలి భారమైన మే
లనుకొని పూను; శేషుఁడు సహస్ర ముఖంబుల గాలి గ్రోలి; తా
ననిశము మోవఁడే మఱి మహాభరమైన ధరిత్రి భాస్కరా!" ,

@"ఊరక సజ్జనుండొదిగి యుండిననైన, దురాత్మకుండు ని
ష్కారణ మోర్వలేక యపకారము చేయుట వాని విద్యగా;
చీరలు నూరు అంకములు చేసెడివైనను బెట్టెనుండగాఁ
జేరి చినింగిపోఁ గొఱుకు చింమట కేమి ఫలంబు భాస్కరా!" ,

				};
			}
		}
	}
}
