//---------------------------------------------------------------------------------------------
// <copyright file="Kumara.cs" company="Chandam-ఛందం">
//    Copyright © 2013 - 2018 'Chandam-ఛందం' : http://chandam.apphb.com
//    Original Author : Dileep Miriyala (m.dileep@gmail.com)
//    Last Updated    : 03-Feb-2018 21:34EST
//    Revisions:
//       Version    | Author                   | Email                     | Remarks
//       1.0        | Dileep Miriyala          | m.dileep@gmail.com        | Initial Commit
//       _._        | <TODO>                   |   <TODO>                  | <TODO>
// </copyright>
//---------------------------------------------------------------------------------------------

namespace Chandam.Samples
{
	public class Kumara : SamplePoems
	{
		public override string[] Poems
		{
			get
			{
				return new string[]
				{
					@"మర్మము పరులకు దెలుపకు
దుర్మార్గుల చెంత నెపుడు దూఱకు మిల దు
ష్కర్మముల జేయ నొల్లకు ;
నిర్మల మతినుంట లెస్స నిజము కుమారా!" ,

@"సద్గోష్ఠి సిరియు నొసగును
సద్గోష్ఠ్యె కీర్తి బెంచుస్సంతుష్టిని నా
సద్గోష్ఠియె యొనగూర్చును
సద్గోష్ఠియె పాపములను జంపు కుమారా!" ,

@"సత్తువగల యాతడు పై
నెత్తిన దుర్భలుండు తస్కరించు నతండున్
విత్తము గోల్పడు నతడును
జిత్తని పీడితుండు జింతజెందు కుమారా!" ,

@"వృద్ధజన సేవ చేసిన
బుద్ధి విశేషజ్ఞుఁడనుచు బూత చరితుడున్
సద్ధర్మశాలియని బుధు
లిద్ధరఁబొగిడెదరు ప్రేమయెసగఁ కుమారా!" ,

@"ఉన్నను లేకున్నను పై
కెన్నడు మర్మంబుఁ దెలుప నేగకుమీ నీ
కన్నతలిదండ్రుల యశం
బెన్నఁబడెడు మాడ్కిఁదిరుగు మెలమిఁగుమారా!" ,

@"ధనవంతుడె కులవంతుడు
ధనవంతుడె సుందరుండు ధనవంతుండే
ఘనవంతుడు బలవంతుడు
ధనవంతుడె ధీరుడనుచు దలతె ? కుమారా!" ,

@"ఆచార్యున కెదిరింపకు 
బ్రోచిన దొర నింద సేయఁ బోకుము కార్యా
లోచనము లొంటిఁ జేయకు
మాచారము విడవఁ బోకుమయ్య కుమారా !" ,

@"వగవకు గడచిన దానికి
పొగడకు దుర్మతుల నెపుడు; పొసగని పనికై
యొగి దీనత నొందకుమీ
తగ దైవగతిం బొసంగు ధరను కుమారా!" ,

@"సిరి చేర్చు బంధువుల నా
సిరియే శుభముల నొసంగు చెలువుల గూర్చున్
సిరియే గుణవంతుండని
ధరలోఁ బొగడించునంచు దలపు కుమారా !" ,

@"పాపపు బని మది దలపకు
చేపట్టిన వారి విడువ జేయకు కీడున్
లోపల తలపకు, క్రూరల 
ప్రాపును మరి నమ్మబోకు, రహిని కుమారా !" ,


				};
			}
		}
	}
}
