//---------------------------------------------------------------------------------------------
// <copyright file="MyFavPoems.cs" company="Chandam-ఛందం">
//    Copyright © 2013 - 2018 'Chandam-ఛందం' : http://chandam.apphb.com
//    Original Author : Dileep Miriyala (m.dileep@gmail.com)
//    Last Updated    : 03-Feb-2018 21:34EST
//    Revisions:
//       Version    | Author                   | Email                     | Remarks
//       1.0        | Dileep Miriyala          | m.dileep@gmail.com        | Initial Commit
//       _._        | <TODO>                   |   <TODO>                  | <TODO>
// </copyright>
//---------------------------------------------------------------------------------------------

using Chandam.Samples;

namespace Library.Chandam.Samples
{
	public class MyFavPoems : SamplePoems
	{

		private string[] _Poems = new string[]{
									"అటజనికాంచెభూమిసురుడంబరచుంభశిరస్సరజ్ఝరీ\nపటలముహుర్ముహుర్ లుఠదభంగతరంగమృదంగనిశ్వన\nస్ఫుటనటనానుకూల పరిపుల్ల కలాపకలాపిజాలమున్\nఘటకచరత్కరేణుకరకంపితసారముశీతసైలమున్",
									"తివిరి యిసుమున తైలంబు దీయవచ్చు\nదవిలి మృగతృష్ణ లో నీరు ద్రావవచ్చు\nతిరిగి కుందేటి కొమ్ము సాధింపవచ్చు\nచేరి మూర్ఖుల మనసు రంజింపరాదు" ,
									"తరువు లతిరసఫలభార గురుత గాంచు\nనింగి వ్రేలుచు నమృత మొసంగు మేఘు\nడుద్ధతులు గారు బుధులు సమృద్ధి చేత\nజగతి నుపకర్తలకు నిది సహజగుణము...!" ,
									"తెలుగదేలయన్న దేశంబు తెలుగేను\nతెలుగు వల్లభుండ తెలు గొకండ;\nఎల్ల నృపులు గొలువ నెరుగవే బాసాడి\nదేశభాష లందు తెలుగు లెస్స." ,
									"గగన భాగమ్ము ప్రావృష ద్విగుణ రోష\nఘటిత నటనోగ్ర ధాటీ విఘటిత ప్రకట\nకుటిల ధూర్జటి ఘన జటా పటల నిటల\nవికట భృకుటీ కుటీర ముద్విగ్న మాయె." ,
									"భరత ఖండంబు చక్కని పాడి యావు\nహిందువులు లేగదూడలై ఏడ్చుచుండ\nతెల్లవారను గడుసరి గొల్లవారు\nపితుకుచున్నారు మూతులు బిగియ గట్టి." ,
									"పలికెడిది భాగవతమట\nపలికించు విభుండు రామ భద్రుండట ;నే\nపలికిన భవహర మగునట\nపలికెద; వేరొండు గాథ పలుకగ నేలా!" ,
									"అంబుజోదర దివ్య పాదారవింద \nచింతనామృత పాన విశేష మత్త\nచిత్తమే రీతి నితరంబు చేరనేర్చు\nవినుత గుణశీల మాటలు వేయునేల",
									"ఘన ఘనాఘన గజ గ్రైవేయ ఘంటికా టంకారములకు ఘంటాపథంబు\nశక్రచా పోదగ్ర శార్దూల పాలనా విభవోన్నతికి భూరి విపిన సీమ\nచటుల ఝంఝా మరు ఛ్ఛతకోటి భేతాళ లుంఠన క్రియలకు రుద్రభూమి\nపటు తటిద్విలసన బ్రహ్మరాక్షస కఠోరాట్టహాసమున కహార్య బిలము" ,
									"మందార మకరంద మాధుర్యమున దేలు మధుపంబు వోవునే మదనములకు\nనిర్మల మందాకినీ వీచికల దూగు రాయంచ జనునె తరంగిణులకు\nలలిత రసాల పల్లవ ఖాదియై చొక్కు కోయిల జేరునే కుటజములకు\nపూర్ణేందు చంద్రికా స్ఫురిత చకోరకం బరుగునే సాంద్ర నీహారములకు" };

		public override string[] Poems
		{
			get
			{
				return _Poems;
			}
		}

		public void Append(string[] Items)
		{
			string[] S = new string[_Poems.Length + Items.Length];
			for (int i = 0; i < _Poems.Length; i++)
			{
				S[i] = _Poems[i];
			}
			for (int i = 0; i < Items.Length; i++)
			{
				S[i + _Poems.Length] = Items[i];
			}
			_Poems = S;
		}
	}
}
