//---------------------------------------------------------------------------------------------
// <copyright file="SriKalaHadteeswara.cs" company="Chandam-ఛందం">
//    Copyright © 2013 - 2018 'Chandam-ఛందం' : http://chandam.apphb.com
//    Original Author : Dileep Miriyala (m.dileep@gmail.com)
//    Last Updated    : 03-Feb-2018 21:34EST
//    Revisions:
//       Version    | Author                   | Email                     | Remarks
//       1.0        | Dileep Miriyala          | m.dileep@gmail.com        | Initial Commit
//       _._        | <TODO>                   |   <TODO>                  | <TODO>
// </copyright>
//---------------------------------------------------------------------------------------------

using Chandam.Samples;

namespace Library.Chandam.Samples
{
	public class SriKalaHadteeswara : SamplePoems
	{
		public override string[] Poems
		{
			get
			{
				return new string[]
				{
		@"దంతంబుల్పడనప్పుడే తనువునందారూఢి యున్నప్పుడే
కాంతాసంఘము రోయనప్పుడె జరక్రాంతంబు గానప్పుడే
వింతల్మేన జరించనప్పుడె కురుల్వెల్లెల్ల గానప్పుడే
చింతింపన్వలె నీపదాంబుజములన్ శ్రీ కాళహస్తీశ్వరా!" ,

@"నిచ్చల్ నిన్ను భజించి చిన్మయమహా నిర్వాణపీఠంబు పై
రచ్చల్సేయక యార్జవంబు కుజన వ్రాతంబుచేఁ గ్రాంగి భూ
భృచ్చండాలురఁ గొల్చి వారు దనుఁ గోపింమన్ బుధుం డార్తుఁడై
చిచ్చారం జము రెల్లఁ జల్లుకొనునో శ్రీ కాళహస్తీశ్వరా!" ,

@"నీకుం గాని కవిత్వ మెవ్వరికి నేనీనంచు మీదెత్తితిన్
జేకొంటిన్ బిరుదంబు కంకణము ముంజేఁ గట్టితిం బట్టితిన్
లోకుల్ మెచ్చ వ్రతంబు నాతనువు కీలుల్ నేర్పులుం గావు ఛీ
ఛీ కాలంబులరీతి దప్పెడు జుమీ శ్రీ కాళహస్తీశ్వరా!" ,

@"క్షితినాధోత్తమ! సత్కవీశ్వరుఁడ్ వచ్చెన్ మిమ్ములం జూడఁగా
నతఁడే మేటి కవిత్వవైఖరిని సద్యఃకావ్యనిర్మాత తత్
ప్రతిభ ల్మంచిని తిట్టుపద్యములు చెప్పుం దాతఁడైనన్ మముం
గ్రితమే చూచెను బొమ్మటంచు రధముల్ శ్రీ కాళహస్తీశ్వరా!" ,

@"తనయుం గాంచి ధనంబు నించి దివిజస్థానంబు గట్టించి వి
ప్రున కుద్వాహము జేసి సత్కృతికిఁ బాత్రుండై తటాకంబు నే
ర్పునఁ ద్రవ్వించి వనంబు వెట్టి మననీ పోలేడు నీసేవఁ జే
సిన పుణ్యాత్ముఁడు పోవు లోకమునకున్ శ్రీ కాళహస్తీశ్వరా!" ,

@"దురమున్ దుర్గము రాయబారము మఱిన్ దొంగర్మమున్ వైద్యమున్
నరనాధాశ్రయ మోడబేరమును బెన్మంత్రంబు సిద్ధించినన్
అరయన్ దొడ్డఫలంబు గల్గునదిగా కాకార్యమే తప్పినన్
సిరియుం బోవును బ్రాణహానియు నగున్ శ్రీ కాళహస్తీశ్వరా!" ,

@"కరిదైత్యున్ బొరిగొన్న శూలము క(రా)రగ్ర(స్థ)స్తంబు గాదో రతీ
శ్వరునిన్ గాల్చిన ఫాలలోచనశిఖా వర్గంబు చల్లాఱెనో
పరనిందాపరులన్ వధింప విదియున్ భాష్యంబె వారేమి చే
సిరి నీకున్ బరమోపకార మరయన్ శ్రీ కాళహస్తీశ్వరా!" ,

@"నిను నిందించిన దక్షుపైఁ దెగవొ వాణీనాధు శాసింపవో
చనునా నీ పాదపద్మసేవకులఁ దుచ్ఛం బాడు దుర్మార్గులం
బెనుపన్ నీకును నీదుభక్తతతికిన్ భేదంబు గానంగ వ
చ్చెనొ లేకుండిన నూఱకుండగలవా శ్రీ కాళహస్తీశ్వరా!" ,

@"పటవద్రజ్జుభుజంగవద్రజతవి భ్రాంతిస్ఫురచ్ఛుక్తివ
ద్ఘటవచ్చంద్రశిలాజపాకుసుమరు క్సాంగత్యవత్తంచువా
క్పటిమల్ నేర్తురు చిత్సుఖం బనుభవింపన్ లేక దుర్మేధనుల్
చిటుకన్నం దలపోయఁజూతు రధముల్ శ్రీ కాళహస్తీశ్వరా!" ,

@"తమనేత్రద్యుతిఁ దామె చూడ సుఖమైతాదాత్మ్యమున్ గూర్పఁగా
విమలమ్ముల్ కమలాభముల్ జితలసద్విద్యుల్లతాలాస్యముల్
సుమనోబాణజయప్రదమ్ములనుచున్ జూచున్ జనంబూనిహా
రిమృగాక్షీనివహమ్ముకన్నుగవలన్ శ్రీ కాళహస్తీశ్వరా!" ,

@"క్షితిలో దొడ్డతురంగసామజము లేచిత్రమ్ము లాందోళికా
తతు లే లెక్క విలాసినీజనసువస్రవ్రాత భూషాకలా
పతనూజాదిక మేమిదుర్లభము నీ పాదమ్ము లర్చించుచో
జితపంకేరుహపాదపద్మయుగళా శ్రీ కాళహస్తీశ్వరా!" ,

@"గడియల్ రెంటికొ మూఁటికో గడియకో కాదేని నేఁడెల్లియో
కడ నేఁడాదికొ యెన్నఁడో యెఱుఁ గ మీకాయంబు లీభూమిపైఁ
బడగా నున్నవి ధర్మమార్గమొకటిం బాటింప రీ మానవుల్
చెడుగుల్ నీపదభక్తియుం దెలియరో శ్రీ కాళహస్తీశ్వరా!" ,

@"జలజశ్రీ గల మంచినీళ్ళు గలవాచత్రాతిలో బాపురే!
వెలివాడ న్మఱి బాఁపనిల్లుగలదావేసాలుగా నక్కటా!
నలి నా రెండు గుణంబు లెంచి మదిలో నన్నేమి రోయంగ నీ
చెలువంబైన గుణంబు లెంచుకొనవే శ్రీ కాళహస్తీశ్వరా!" ,

@"భసితోద్ధూళనధూసరాంగులు జటాభారోత్తమాంగుల్ తపో
వ్యసనముల్ సాధితపంచవర్ణరసముల్ వైరాగ్యవంతుల్ నితాం
తసుఖస్వాంతులు సత్యభాషణలు నుద్యద్రత్నరుద్రాక్షరా
జిసమేతుల్ తుదనెవ్వరైన గొలుతున్ శ్రీ కాళహస్తీశ్వరా!" ,

@"చెడుగుల్ కొందఱు కూడి చేయంగంబనుల్ చీకట్లు దూఱంగఁ మా
ల్పడితిం గాన గ్రహింపరాని నిను నొల్లంజాలఁ బొమ్మంచు నిల్
వెలంద్రోచినఁ జూరుపట్టుకొని నే వ్రేలాడుదుం గోర్కిఁ గో
రెడి యర్ధంబులు నాకు నేల యిడవో శ్రీ కాళహస్తీశ్వరా!" ,

@"జాతుల్ సెప్పుట సేవసేయుట మృషల్ సంధించు టన్యాయవి
ఖ్యాతిం బొందుట కొండెకాఁడవుట హింసారంభకుండౌట మి
ధ్యాతాత్పర్యములాడుటన్నియుఁ బరద్రవ్యంబునాశించి యీ
శ్రీ తా నెన్నియుగంబు లుండఁగలదో శ్రీ కాళహస్తీశ్వరా!" ,

@"తాతల్ తల్లియుఁ దండ్రియున్ మఱియుఁ బెద్దల్ చావగాఁ జూడరో
భీతిం బొందఁగనేల చావునకుఁగాఁ బెండ్లాముబిడ్డల్ హిత
వ్రాతంబున్ బలవింప జంతువులకున్ వాలాయమైయుండంగాఁ
జేతోవీధి నరుండు నిన్గొలువఁడో శ్రీ కాళహస్తీశ్వరా!" ,

@"పదివేలలైనను లోకకంటకులచేఁ బ్రాప్రించు సౌఖ్యంబు నా
మదికిం బథ్యము గాదు సర్వమునకున్ మధ్యస్థుఁడై సత్యదా
నదయాదుల్ గల రాజు నాకొసఁగు మేనవ్వాని నీ యట్లచూ
చి దినంబున్ ముదమొందుదున్ గడపటన్ శ్రీ కాళహస్తీశ్వరా!" ,

@"కాలద్వారకవాటబంధనము దుష్కాల్ప్రమాణక్రియా
లోలాజాలకచిత్రగుప్తముఖవ ల్మీకోగ్రజిహ్వాద్భుత
వ్యళవ్యాళవిరోధి మృత్యుముఖదంష్ట్రా(అ)హార్య వజ్రంబు ది
క్చేలాలంకృత! నీదునామ మరయన్ శ్రీ కాళహస్తీశ్వరా!" ,

@"మొదలన్భక్తులకిచ్చినాఁడవుగదా మోక్షంబు నేఁ డేమయా
’ముదియంగా ముదియంగఁ బుట్టు ఘనమౌ మోహంబు లోభంబు’ న
న్నది సత్యంబు కృపం దలంప నొకవుణ్యాత్ముండు నిన్నాత్మ గొ
ల్చి దినంబున్ మొఱవెట్టఁగాఁ గటగటా! శ్రీ కాళహస్తీశ్వరా!" ,

@"ఆరావం బుదయించెఁ దారకముగ నాత్మాభ్రవీధిన్మహా(అ)
కారోకారమకారయుక్తమగు నోంకారాభిధానంబు చె
న్నారున్ విశ్వ మనంగఁ దన్మహిమచే నానాదబిందుల్ సుఖ
శ్రీ రంజిల్లఁ గడంగు నీవదె సుమీ శ్రీ కాళహస్తీశ్వరా!" ,

@"దయ జూడుండని గొందఱాడుదురు నిత్యంబున్ నినుం గొల్చుచున్
నియమం బెంతో ఫలంబు నంతియెకదా నీవీయ పిండెంతో అం
తియకా నిప్పటియుం దలంపనను బుద్ధిం జూడ; నేలబ్బుని
ష్క్రియతన్ నిన్ను భజింప కిష్టసుఖముల్ శ్రీ కాళహస్తీశ్వరా!" ,

@"ఊరూరం జనులెల్ల బిక్ష మిదరోయుందం గుహల్గల్గవో
చీరానీకము వీధులం దొరుకరో శీతామృతస్వచ్ఛవాః
పూరం బేరులఁ బాఱదో తపసులంబ్రోవంగ నీవోపవో
చేరం బోవుదురేల రాగుల జనుల్ శ్రీ కాళహస్తీశ్వరా!" ,

@"ద్వారద్వారములందుఁ జంచుకిజనవ్రాతంబు దండంములన్
దోరంత్స్థలి బగ్గనం బొడుచుచున్ దుర్భాషలాడ న్మఱిన్
వారిం బ్రార్ధనచేసి రాజులకు సేవల్సేయఁగాఁబోరుల
క్ష్మీరాజ్యంబును గోరి నీమరిజనుల్ శ్రీ కాళహస్తీశ్వరా!" ,

@"నన్నే యెనుఁగుతోలుదుప్పటము బువ్వాకాలకూతంబు చే
గిన్నే బ్రహ్మకపాల ముగ్రమగు భోగే కంఠహారంబు మేల్
నిన్నీలాగున నుంటయుం దెలిసియున్ నీపాదపద్మంబు చే
ర్చెన్ నారయణుఁ డెట్లు మానసముఁ దా శ్రీ కాళహస్తీశ్వరా!" ,

@"నిన్నం జూడరొ మొన్నఁ జూడరో జనుల్ నిత్యంబు జావంగ నా
పన్ను ల్గన్ననిధాన మయ్యెడి ధనభ్రాంతిన్ విసర్జింపలే
కున్నా రెన్నఁడు నిన్ను గండు రిక మర్త్వుల్ గొల్వరేమో నినున్
విన్నం బోవక యన్యదైవరతులన్ శ్రీ కాళహస్తీశ్వరా!" ,

@"రాజశ్రేణికి దాసులై సిరులఁ గోరం జేరంగా సౌఖ్యమో
యీ జన్మంబు తరింపఁజేయగల మిమ్మే ప్రొద్దు సేవించు ని
ర్వ్యాజాచారము సౌఖ్యమో తెలియలేరౌ మానవు ల్పాపరా
జీజాతాతిమదాంధబుద్ధు లగుచున్ శ్రీ కాళహస్తీశ్వరా!" ,

@"సంపద్గర్వముఁ బాఱఁద్రోలి రిపులన్ జంకించి యాకాంక్షలన్
దంపుల్వెట్టి కళంకము ల్నఱకి బంధక్లేశదోషంబులం
జింపుల్సేసి వయోవిలాసములు సంక్షేపించి భూతంబులం
జెంపల్వేయక నిన్నుఁ గాననగునా శ్రీ కాళహస్తీశ్వరా!" ,

@"నీపైఁ గాప్యము చెప్పుచున్న యతఁడున్నీపద్యముల్ వ్రాసియి
మ్మా పాఠంమొనరింతునన్న యతఁడున్ మంజుప్రబంధంబు ని
ష్టాపూర్తిం బఠియించుచున్న యతఁడున్ సద్బాంధవుల్ గాక చీ
చీ! పృష్ఠాగతబాంధవంబు నిజమా! శ్రీ కాళహస్తీశ్వరా!" ,

@"విత్తజ్ఞానము పాదు చిత్తము భవావేశంబు రక్షాంబువుల్
మత్తత్వంబు తదంకురం ఐనృతముల్ మాఱాకు లత్యంతదు
ద్వృత్తుల్ పువ్వులుఁ బండ్లు మన్మధముఖా విర్భూతదోషంబులుం
జిత్తాధ్యున్నతనింబభూజమునకున్ శ్రీ కాళహస్తీశ్వరా!" ,

@"వేధం దిట్టగరాదుగాని భువిలో విద్వాంసులంజేయ నే
లా ధీచాతురిఁ జేసెఁ జేసిన గులామాపాటనే పోక క్షు
ద్బాధాదుల్ గలిగింపనేల యది కృత్యంబైన దుర్మార్గులం
జీ! ధాత్రీశులఁ జేయనేఁటి కకటా! శ్రీ కాళహస్తీశ్వరా!" ,

@"తమకొం బొప్పఁ బరాంగనాజనపర ద్రవ్యంబులన్ మ్రుచ్చిలం
గ మహోద్యోగము సేయనెమ్మనముదొంగం బట్టి వైరాగ్యపా
శములం జుట్టి బిగిమంచి నీదుచరణ స్తంభంజునం గట్టివై
చి ముదం బెప్పుడుఁ గల్గఁజేయ గడవే శ్రీ కాళహస్తీశ్వరా!" ,

@"కేదారాదిసమస్తతీర్ధములు కోర్మింజూడఁ బోనేఁటికిన్
గాడా ముంగిలి వారణాసి! కడుపే కైలాసశైలంబు మీ
పాదధ్యానము సంభవించునపుడే భావింప నజ్ఞానల
క్ష్మీదారిద్ర్యులు గారె లోకు లకటా! శ్రీ కాళహస్తీశ్వరా!" ,

@"ఒకపూఁటించుక కూడ తక్కువగునే నోర్వంగలేఁ డెండకో
పక నీడన్వెదకుం జలిం జడిచి కుంపట్లెత్తుకోఁజూచు వా
నకు నిండిండ్లును దూఱు నీతనువు దీనన్వచ్చు సౌఖ్యంబు రో
సి కడాసింపరుగాక మర్త్వులకట శ్రీ కాళహస్తీశ్వరా!" ,

@"కాసంతైన సుఖం బొనర్చునొ మనఃకామంబు లీడేర్చునో
వీసంబైనను వెంటవచ్చునొ జగద్విఖ్యాతిఁ గావించునో
దోసంబు ల్బెడఁ బొపునో వలసినందోడ్తో మిముం జూపునో
ఛీ! సంసారదురాశ యేలుదుపవో శ్రీ కాళహస్తీశ్వరా!" ,

@"మొదలం జేసినవారి ధర్మములు నిర్మూలంబుగాఁ జేసి దు
ర్మదులై యిప్పుడు వారె ధర్మము లొనర్పం దమ్ము దైవంబు న
వ్వడె రానున్న దురాత్ములెల్ల దమ త్రోవం బోవరే ఏల చే
సెదరో మీఁదు దలంచిచూడ కధముల్ శ్రీ కాళహస్తీశ్వరా!" ,

@"పరిశీలించితి మంత్రతంత్రములు చెప్ప న్వింటి సాంఖ్యాదియో
గ రహస్యంబులు వేద శాస్త్రములు వక్కాణించితిన్ శంకవో
దరయం గుమ్మడికాయలోని యవగింజంతైన నమ్మిచ్ంచి సు
స్థిరవిజ్ఞానము త్రోవఁ జెప్పఁగదవే శ్రీ కాళహస్తీశ్వరా!" ,

@"వెనుక్ం జేసిన ఘోరదుర్దశలు భావింపంగ రోఁతయ్యెడున్
వెనుకన్ ముందట వచ్చు దుర్మరణముల్ వీక్షింప భీతయ్యెడున్
నను నేఁజూడగ నావిధుల్దలంచియున్ నాకే భయం బయ్యెడుం
జెనకుంజీఁకటియాయెఁ గాలమునకున్ శ్రీ కాళహస్తీశ్వరా!" ,

@"చవిగాఁ జూడ వినంగ మూర్కొనఁ దనూసంఘర్షణాస్వాదమొం
ద వినిర్మించెద వేల జంతువుల నేతత్క్రీడలే పాతక
వ్యవహారంబలు సేయునేమిటికి మాయావిద్యచే బ్రొద్దుపు
చ్చి వినోదింపఁగ దీన నేమి ఫలమో శ్రీ కాళహస్తీశ్వరా!" ,

@"##మాయా(అ) జాండకరండకోటిఁ బొడిగామర్ధించిరో విక్రమా(అ)
జేయుం గాయజుఁ జంపిరో కపటలక్ష్మీ మోహముం బాసిరో
యాయుర్దయభుజంగమృత్యువు ననాయాసంబునన్ గెల్చిరో
శ్రేయోదాయక్ లౌదు రెట్టు లితరుల్ శ్రీ కాళహస్తీశ్వరా!" ,

@"##అయవారై చరియింపవచ్చుఁ దన పాదాం(అ)భోజతీర్ధంబులన్
దయతోఁ గొమ్మనవచ్చు సేవకుని యర్ధప్రాణదేహాదుల
న్నియు నా సొమ్మనవచ్చుఁగాని సిరులన్నిందించి నిన్నాత్మని
ష్క్రియతం గానఁగరాదు పండితులకున్ శ్రీ కాళహస్తీశ్వరా!" ,

@"శ్రీ శైలేశు భజింతునో యభవుంగాంచీ నాధు సేవింతునో
కాశీవల్లభుఁ గొల్వంబోదునొ మహా కాళేశుఁ బూజింతునో
నాశీలం బణువైన మేరు వనుచున్ రక్షింపవే నీ కృపా
శ్రీ శృంగారవిలాసహాసములచే శ్రీ కాళహస్తీశ్వరా!" ,

@"#రోసిం దేంటిది రోఁత దేంటిది మనొ రోగస్థుండై దేహి తాఁ
బూసిందేంటిది పూఁత లేంటివి మదా(అ)పూతంబు లీ దేహముల్
మూసిందేంటిది మూఁతలేంటివి సదామూఢత్వమే కాని తాఁ
జేసిందేంటిది చేంతలేఁటివి వృధా శ్రీ కాళహస్తీశ్వరా!" ,

@"చదువుల్ నేర్చిన పండితాధములు స్వేచ్ఛాభాషణక్రీడలన్
వదరన్ సంశయభీకరాటవులం ద్రోవల్దప్పి వర్తింపఁగా
మదనక్రోధకిరాతులందుఁ గని భీమప్రౌఢిచేఁ దాఁకినం
జెదరుం జిత్తము చిత్తగింపఁగదవే శ్రీ కాళహస్తీశ్వరా!" ,

@"జ్ఞాతుల్ ద్రోహంబు వాండ్రు సేయుకపటేర్యాది క్రియాదోషముల్
మాతండ్రాన సహింపరాదు ప్రతికర్మంబించుకే జేయగాఁ
బోతే దోసము గాన మాని యతినై పోఁగోరినన్ సర్వదా
చేతఃక్రోధము మాన దెట్లు నడుతున్ శ్రీ కాళహస్తీశ్వరా!" ,

@"నీ కారుణ్యముఁ గల్గినట్టి నరుఁ డేనీచాలయంబుల జొరం
డేకార్పణ్యపు మాటలాడ నరుగం డెవ్వారితో వేషముల్
గైకోడే మతముల్ భజింపఁ డిలనేకష్టప్రకారంబులన్
జీకాకై చెడిపోఁదు జీవనదశన్ శ్రీ కాళహస్తీశ్వరా!" ,

@"ఒకరిం జంపి పదస్థులై బ్రతుకఁ దామొక్కొక్క రూహింతురే
లొకొ తామెన్నఁడుఁ జావరో తమకుఁ బోవో సంపదల్ పుత్రమి
త్రకళత్రాదులతోడ నిత్య సుఖమందం గందురో యున్నవా
రికి లేదో మృతి యెన్నఁడుం గటకట శ్రీ కాళహస్తీశ్వరా!" ,

@"శుకముల్ కింశుకపుష్పముల్ గని ఫలస్తోమం బటంచున్సము
త్సుకతం దేరఁగఁ బోవు నచ్చట మహా దుఃఖంబు సిద్ధించుఁ; గ
ర్మకళాభాషలకెల్లఁ బ్రాపులగు శాస్త్రంబు ల్విలోకించువా
రికి నిత్యత్వమనీష దూరమగుఁజూ శ్రీ కాళహస్తీశ్వరా!" ,

@"ఒకయర్ధంబు నిన్ను నే నడుగఁగా నూహించి నెట్లైనఁ బొ
మ్ము కవిత్వంబులు నాకుఁ జెందనివి యేమో యంటివా నాదుజి
హ్వకు నైసర్గిక కృత్య మింతియ సుమీ ప్రార్ధించుటే కాదు కో
రికల న్నిన్నునుగాన నాకు వశమా శ్రీ కాళహస్తీశ్వరా!" ,

@"అకలంకస్థితి నిల్పి నాడ మను ఘంటా(ఆ)రావమున్ బిందుదీ
పకళాశ్రేణి వివేకసాధనములొప్పన్ బూని యానందతా
రకదుర్గాటవిలో మనోమృగముగర్వస్ఫూర్తి వారించువా
రికిఁగా వీడు భవోగ్రబంధలతికల్ శ్రీ కాళహస్తీశ్వరా!" ,

@"##అకలంకస్థితి నిల్పి నాడ మను ఘంటా(ఆ)రావమున్ బిందుదీ
పకళాశ్రేణి వివేకసాధనములొప్పన్ బూని యానందతా
రకదుర్గాటవిలో మనోమృగముగర్వస్ఫూర్తి వారించువా
రికిఁగా వీడు భవోగ్రబంధలతికల్ శ్రీ కాళహస్తీశ్వరా!" ,

@"స్తోత్రం బన్యులఁ జేయనొల్లని వ్రతస్థుల్వోలె వేసంబుతోఁ
బుత్రీ పుత్ర కలత్ర రక్షణ కళాబుధ్ధిన్ నృపాలా(అ)ధమన్
బాత్రం బంచు భజింపఁబోదు రితియున్ భాష్యంబె యివ్వారిచా
రిత్రం బెన్నఁడు మెచ్చ నెంచ మదిలో శ్రీ కాళహస్తీశ్వరా!" ,

@"సంతోషించితినిఁ జాలుంజాలు రతిరాజద్వారసౌఖ్యంబులన్
శాంతిన్ బొందితిఁ జాలుఁజాలు బహురాజద్వారసౌఖ్యంబులన్
శాంతిం బొందెదఁ జూపు బ్రహ్మపదరాజద్వారసౌఖ్యంబు ని
శ్చింతన్ శాంతుఁడ నౌదు నీ కరుణచే శ్రీ కాళహస్తీశ్వరా!" ,

@"అంతా సంశయమే శరీరఘటనంబంతా విచారంబె లో
నంతా దుఃఖపరంపరానివితమె మేనంతా భయభ్రాంతమే
యంతానంతశరీరశోషణమె దుర్వ్యాపారమే దేహికిన్
జింతన్ నిన్నుఁ దలంచి పొందరు నరుల్ శ్రీ కాళహస్తీశ్వరా!" ,

@"రతిరా జుద్ధతి మీఱ నొక్కపరి గోరాజాశ్వుని న్నొత్తఁ బో
నతఁ డాదర్పకు వేగ నొత్త గవయం బాంబోతునుం దాఁకి యు
గ్రతఁ బోరాడంగనున్న యున్నడిమి లేఁగల్వోలె శోకానల
స్థితిపాలై మొఱపెట్టునన్ మనుపవే శ్రీ కాళహస్తీశ్వరా!" ,

@"గతి నీవంచు భజించువార లపవర్గం బొందగానేల సం
తతముం గూటికినై చరింప వినలేదా ’యాయు రన్నం ప్రయ
చ్ఛతి’ యంచున్మొఱవెట్టగా శ్రుతులు సంసారాంధకారాభి దూ
షితదుర్మార్గుల్ గానఁ గానంబడవో శ్రీ కాళహస్తీశ్వరా!" ,

@"శ్రుతులభ్యాసముచేసి శాస్త్రగరిమల్ శోధించి తత్త్వంబులన్
మతి నూహించి శరీర మస్థిరము బ్రహ్మంబెన్న సత్యంబు గాం
చితి మంచున్ సభలన్ వృధావచనము ల్చెప్పంగనే కాని ని
ర్జితచిత్తస్థిర సౌఖ్యముల్ దెలియరో శ్రీ కాళహస్తీశ్వరా!" ,

@"కలధౌతాద్రియు నస్థిమాలికయు గోగంధర్వమున్ బున్కయుం
బులితోలు న్భసితంబుఁ బాఁపతొదవుల్ పోకుండఁ దోఁబుట్లకై
తొలి నేవారలతోడఁ బుట్టక కళాదుల్గల్గె మేలయ్యెనా
సిలువుల్దూరముచేసికొం టెఱింగియే శ్రీ కాళహస్తీశ్వరా!" ,

@"సులభుల్మూర్ఖు లనుత్తమోత్తముల రాజుల్గల్గియేవేళ న
న్నలంతలబెట్టిన నీ పదాబ్ధములఁ బాయంజాల నేమిచ్చినం
గలధౌతాచల మేలు టంబునిధిలోఁ గాపుండు టబ్జంబు పైఁ
జెలువొప్పున్ సుఖియింపఁ గాంచుట సుమీ శ్రీ కాళహస్తీశ్వరా!" ,

@"ఆలుం బిడ్డలు మిత్రులున్ హితులు నిష్టర్ధంబు లీనేర్తురే
వేళ న్వారి భజింపఁ జాలిపడ కావిర్భూత మోదంబునం
గాలంబెల్ల సుఖంబు నీకు నిఁక భక్తశ్రేణి రక్షింపకే
శ్రీలెవ్వారికిఁ గూడంబెట్టెదవయా శ్రీ కాళహస్తీశ్వరా!" ,

@"తలమీఁదం గుసుమప్రసాద మలికస్థానంబుపై భూతియున్
గళసీమంబున దండ నాసికతుదన్ గంధప్రసారంబు లో
పల నైవేద్యముఁ జేర్చు నే మనుజ్ఁ డాభక్తుండు నీకెప్పుడుం
జెలికాడై విహరించు రౌప్యగిరిపై శ్రీ కాళహస్తీశ్వరా!" ,

@"పాలుం బువ్వయుఁ బెట్టెదం గుడువరా పాపన్న రా యన్న లే
లేలెమ్మన్న నరంటిపండ్లుఁ గొని తేలేకున్న నేనొల్లనం
టే లాలింపరె తల్లిదండ్రులపు డట్లే తెచ్చి వాత్సల్య ల
క్ష్మీలీలావచనంబులం గుడుపరా శ్రీ కాళహస్తీశ్వరా!" ,

@"ఏలీల న్నుతియింపవచ్చు నుపమోత్ప్రేక్షాధ్వనివ్యంగ్యశ
బ్ధాలంకారవిశేషభాషల కలభ్యంబైన నీరూపముం
జాలుంజాలుఁ గవిత్వముల్నిలుచునే సత్యంబు వర్ణించుచో
చీ! లజ్జింపరుగాక మాదృశకవుల్ శ్రీ కాళహస్తీశ్వరా!" ,

@"జలకంబుల్ రసముల్ ప్రసూనములు వాచాబంధముల్ వాద్యము
ల్కలశబ్ధధ్వను లంచితాంబర మలంకారంబు దీప్తుల్మెఱుం
గులు నైవేద్యము మాధురీ మహిమగాఁ గొల్తున్నినున్ భక్తిరం
జిల దివ్యార్చన గూర్చి నేర్చిన క్రియన్ శ్రీ కాళహస్తీశ్వరా!" ,

@"మలభూయిష్ట మనోజధామము సుషుమ్నాద్వారమో యారు కుం
డలియో పాదకరాక్షియుగ్మంబులు షట్కంజంబులో మోము దా
జలజంబో నిటలంబు చంద్రకళయో సంగంబు యోగంబొ గా
సిలి సేవింతురు కాంతలన్ భువి జనుల్ శ్రీ కాళహస్తీశ్వరా!" ,

@"తను వెందాక ధరిత్రి నుండు నను నందాకన్ మహారోగదీ
పనదుఃఖాదులఁ బొందకుండ ననుకంపాదృష్టి వీక్షించి యా
వెనుకన్ నీపదపద్మముల్ దలఁచుచున్ విశ్వప్రపంచంబుఁ బా
సిన చిత్తంబున నుండఁజేయంగదవే శ్రీ కాళహస్తీశ్వరా!" ,

@"మును నేఁ బుట్టిన పుట్టు లెన్ని గలవో మోహంబుచే నందుఁజే
సిన కర్మంబుల ప్రోవు లెన్ని గలవో చింతించినన్ గాన నీ
జననంబే యని యున్న వాడ నిదియే చాలింపవే నిన్నుఁ గొ
ల్చిన పుణ్యంబునకుం గృపారతుఁడవై శ్రీ కాళహస్తీశ్వరా!" ,

@"లేవో కానలఁ గంధమూలఫలముల్ లేవో గుహల్ తోయముల్
లేవో యేఱులఁ బల్లవాస్తరణముల్ లేవో సదా యాత్మలో
లేవో నీవు విరక్తుల న్మనుప జాలిం బొంది భూపాలురన్
సేవల్ సేయఁగఁ బోదు రేలొకొ జనుల్ శ్రీ కాళహస్తీశ్వరా!" ,

@"పవి పుష్పంబగు నగ్ని మంచగు నకూపారంబు భూమీస్థలం
బవు శత్రుం డతిమిత్రుఁడౌ విషము దివ్యాహారమౌ నెన్నఁగా
నవనీమండలిలోపలన్ శివ శివే త్యాభాషణోల్లాసికిన్
శివ నీ నామము సర్వవశ్యకరమౌ శ్రీ కాళహస్తీశ్వరా!" ,

@"భవదుఃఖంబులు రాజకీటముల నేబ్రార్ధించినం బాయునే
భవదంఘ్రిస్తుతిచేతఁగాక విలసద్బాలక్షుధాక్లేశదు
ష్టవిధుల్మానునె చూడ మేఁకమెడచంటందల్లి కారుణ్యద్బ
ష్థివిశేషంబున నిచ్చి చంటఁబలె నో శ్రీ కాళహస్తీశ్వరా!" ,

@"చనువారిం గని యేద్చువారు జముఁడా సత్యంబుగా వత్తు మే
మనుమానంబిఁక లేదు నమ్మమని తారావేళ నారేవునన్
మునుఁగంబోవుచు బాస సేయుట సుమీ ముమ్మాటికిం జూడగాఁ
జెనటుల్గానరు దీనిభావమిదివో శ్రీ కాళహస్తీశ్వరా!" ,

@"అమరస్త్రీల రమించినం జెడదు మోహం బింతయున్ బ్రహ్మప
ట్టము సిధ్ధించిన నాస దీఱదు నిరూఢక్రోధమున్ సర్వలో
కముల న్మ్రింగిన మాన దిందుఁ గడతున్ శ్రీ కాళహస్తీశ్వరా!" ,

@"పవమానాశనభూషణప్రకరమున్ భద్రేభచర్మంబు నా
టవికత్వంబుఁ ప్రియంబులై భుగహశుండాలాతవీచారులన్
భవదుఃఖంబులఁ బాపు టొప్పుఁ జెలఁదింబాటించి కైవల్యమి
చ్చి వినోదించుట కేమి కారణమయా శ్రీ కాళహస్తీశ్వరా!" ,

@"మును నీచే నపవర్గరాజ్యపదవీ మూర్ధాభిషేకంబు గాం
చిన పుణ్యాత్ములు నేను నొక్కసరివో చింతించి చూడంగ నె
ట్లనినం గీటఫణీంద్రపోతమదవే దండోగ్రహింసావిచా
రిని గాంగాఁ నిను గానఁగాక మదిలో శ్రీ కాళహస్తీశ్వరా!" ,

@"రాజన్నంతనె పోవునా కృపయు ధర్మంబాభిజాత్యంబు వి
ద్యాజాతక్షమ సత్యభాషణము విద్వన్మిత్రసంరక్షయున్
సౌగన్యంబు కృతంబెఱుంగటయు విశ్వాసంబు గాకున్న దు
ర్బీజశ్రేష్థులు గాఁ గతంబు గలదే శ్రీ కాళహస్తీశ్వరా!" ,

@"పదునాల్గేలె మహాయుగంబు లొక భూపాలుండు; చెల్లించె న
య్యుదయాస్తాచలసంధి నాజ్ఞ నొకఁ డాయుష్మంతుండై వీరియ
భ్యుదయం బెవ్వరు చెప్పఁగా వినరొ యల్పుల్మత్తులై యేల చ
చ్చెదరో రాజుల మంచు నక్కటకటా! శ్రీ కాళహస్తీశ్వరా!" ,

@"తనువే నిత్యముగా నొనర్చు మదిలేదా చచ్చి జన్మింపకుం
డ నుపాయంబు ఘటింపు మాగతుల రెంట న్నేర్పు లేకున్న లే
దని నాకిప్పుడ చెప్పు చేయఁగల కార్యంబున్న సంసేవఁ జే
సి నినుం గాంచెదఁగాక కాలముననో శ్రీ కాళహస్తీశ్వరా!" ,

@"ఆలంచు న్మెడఁ గట్టి దానికి నవత్యశ్రేణిఁ గల్పించి త
ద్భాలవ్రాతము నిచ్చిపుచ్చుటను సంబంధంబు గావించి యా
మాలర్మంబున బాంధవం బనెడి ప్రేమం గొందఱం ద్రిప్పఁగాఁ
సీలన్సీల యమర్చిన ట్లొసఁగితో శ్రీ కాళహస్తీశ్వరా!" ,

@"దినముం జిత్తములో సువర్ణముఖరీ తీరప్రదేశామ్రకా
ననమధ్యోపల వేదికాగ్రమున నానందంబునం బంకజా
నననిష్థ న్నునుఁ జూడఁ గన్ననదివో సౌఖ్యంబు లక్ష్మీవిలా
సినిమాయానటనల్ సుఖంబు లగునే శ్రీ కాళహస్తీశ్వరా!" ,

@"చావం గాలము చేరువౌ టెఱిఁగియుం జాలింపఁగా లేక న
న్నెవైద్యుండు చికిత్సఁ బ్రోవఁగలఁడో యేమందు రక్షించునో
ఏ వేల్పుల్ కృపఁజూతురో యనుచు నిన్నింతైనఁ జింతింపఁడా
జీవచ్ఛ్రాధ్ధముఁ జేసికొన్న యతియున్ శ్రీ కాళహస్తీశ్వరా!" ,

@"ఎన్నేళ్ళుందు నేమి గందు నిఁకనేనెవ్వారి రక్షించెదన్
నిన్నే నిష్ఠ భజించెద న్నిరుపమోన్నిద్రప్రమోదంబు నా
కెన్నండబ్బెడు న్ంతకాలమిఁక నేనిట్లున్న నేమయ్యెడిం?
జిన్నంబుచ్చక నన్ను నేలుకొలవే శ్రీ కాళహస్తీశ్వరా!" ,

	};
			}
		}
	}
}