//---------------------------------------------------------------------------------------------
// <copyright file="Sumati.cs" company="Chandam-ఛందం">
//    Copyright © 2013 - 2018 'Chandam-ఛందం' : http://chandam.apphb.com
//    Original Author : Dileep Miriyala (m.dileep@gmail.com)
//    Last Updated    : 03-Feb-2018 21:34EST
//    Revisions:
//       Version    | Author                   | Email                     | Remarks
//       1.0        | Dileep Miriyala          | m.dileep@gmail.com        | Initial Commit
//       _._        | <TODO>                   |   <TODO>                  | <TODO>
// </copyright>
//---------------------------------------------------------------------------------------------

namespace Chandam.Samples
{
	public class Sumati : SamplePoems
	{

		public override string[] Poems
		{
			get
			{
				return new string[]
				{
					@"అక్కరకురాని చుట్టము,
మ్రొక్కిన వరమీన వేల్పు, మోహరమునదా
నెక్కిన బాఱని గుఱ్ఱము,
గ్రక్కున విడువంగవలయు గదరా సుమతీ." ,

@"అప్పిచ్చువాడు, వైద్యుడు,
నెప్పుడు నెడతెగక బాఱు నేఱును, ద్విజుడున్
జొప్పడిన యూర నుండుము,
చొప్పడకున్నట్టి యూరు సొరకుము సుమతీ." ,

@"శ్రీరాముని దయచేతను
నారూఢిగ సకల జనులు నౌరా యనగా
ధారాళమైన నీతులు
నోరూరగ జవులుబుట్ట నుడివెద సుమతీ." ,


@"కనకపు సింహాసనమున
శునకము గూర్చుండబెట్టి శుభ లగ్నమునం
దొనరగ బట్టము గట్టిన
వెనుకటి గుణమేల మాను వినరా సుమతీ." ,

@"ఎప్పుడు సంపద కలిగిన
నప్పుడు బంధువులు వత్తు రది యెట్లన్నన్‌
తెప్పలుగ జెఱువు నిండిన
గప్పలు పదివేలు చేరు గదరా సుమతీ." ,

@"ఉపకారికి నుపకారము
విపరీతము గాదు సేయ వివరింపంగా;
నపకారికి నుపకారము
నెపమెన్నక సేయువాడు నేర్పరి సుమతీ." ,

@"ఎప్పటి కెయ్యది ప్రస్తుత
మప్పటికా మాటలాడి, యన్యుల మనముల్‌
నొప్పించక, తా నొవ్వక,
తప్పించుక తిరుగువాడు ధన్యుడు సుమతీ." ,

@"కమలములు నీట బాసిన
కమలాప్తుని రశ్మి సోకి కమలిన భంగిన్‌
తమ తమ నెలవులు దప్పిన
తమ మిత్రులు శత్రులౌట తథ్యము సుమతీ." ,

@"అడిగిన జీతంబియ్యని
మిడిమేలపు దొరను గొల్చి మిడుకుట కంటెన్‌
వడిగల యెద్దుల గట్టుక
మడి దున్నుకు బ్రతుక వచ్చు మహిలో సుమతీ" ,
									   @"స్త్రీల ఎడ వాదులాడక
బాలురతో జెలిమిచేసి భాషింపకుమీ
మేలైన గుణము విడువకు
ఏలిన పతి నిందసేయ కెన్నడు సుమతీ!" ,

@"సిరి దా వచ్చిన వచ్చును
సలలితముగ నారికేళ సలిలము భంగిన్
సిరి దాఁ బోయిన బోవును
కరిమింగిన వెలగపండు కరణిని సుమతీ!" ,

@"మేలెంచని మాలిన్యుని
మాలను నగసాలివాని మంగలి హితుగా
నేలిన నరపతి రాజ్యము
నేలఁగలసిపోవుగాని నెగడదు సుమతీ!" ,

@"సరసము విరసము కొరకే
పరిపూర్ణ సుఖంబు అధిక బాధల కొరకే
పెరుగుట విరుగుట కొరకే
ధర తగ్గుట హెచ్చుకొరకే తధ్యము సుమతీ!" ,

@"శుభముల నొందని చదువును
అభినయమున రాగరసము నందని పాటల్
గుభగుభలు లేని కూటమి
సభమెచ్చని మాటలెల్లఁ జప్పన సుమతీ!" ,

@"వేసరవు జాతి కానీ
వీసముఁ దాజేయనట్టి వ్యర్థుడు గానీ
దాసి కొడుకైన గాని
కాసులు గలవాఁడే రాజు గదరా సుమతీ!" ,

@"వెలయాలు సేయు బాసలు
వెలయఁగ నగపాలి పొందు, వెలమల చెలిమిన్
గలలోఁన గన్న కలిమియు,
విలసితముగ నమ్మరాదు వినరా సుమతీ!" ,

@"వెలయాలివలనఁ గూరిమి
గలుగదు మరి గలిగెనేని కడతేరదుగా
పలువురు నడిచెడి తెరుపునఁ
బులు మొలవదు మొలిచెనేని బొదలదు సుమతీ!" ,

@"వీడెము సేయని నోరును
జేడెల యధరామృతంబుఁ జేయని నోరును
బాడంగరాని నోరును
బూడిద కిరవైన పాడు బొందర సుమతీ!" ,

@"వినదగు నెవ్వరుచెప్పిన
వినినంతనె వేగపడక వివరింపదగున్
కనికల్ల నిజము దెలిసిన
మనుజుడే పో నీతిపరుడు మహిలో సుమతీ!" ,

@"వరి పంటలేని యూరును
దొరయుండని యారు తోడు దొరకని తెరువున్
ధరను బతిలేని గృహమును
అరయంగా రుద్రభూమి యనదగు సుమతీ!" ,

@"వరదైన చేను దున్నకు
కరవైనను బంధుజనుల కడకేగకుమీ
పరులకు మర్మము సెప్పకు
పిరికికి దళవాయితనము బెట్టకు సుమతీ!" ,

@"లావుగలవానికంటెను
భావింపఁగ నీతిపరుఁడు బలవంతుండౌ
గ్రావంబంత గజంబును
మావటివాఁడెక్కినట్లు మహిలో సుమతీ!" ,

@"రూపించి పలికి బొంకకు
ప్రాపగు చుట్టంబు నెగ్గు పలుకకు మదిలోఁ
గోపించురాజుఁ గొల్వకు
పాపుదేశంబు సొరకు పదిలము సుమతీ!" ,

@"రా పొమ్మని పిలువని యా
భూపాలునిఁ గొల్వ ముక్తి ముక్తులు గలవే
దీపంబు లేని ఇంటను
చెవుణికీళ్లాడినట్లు సిద్ధము సుమతీ!" ,

@"నాది నొకని వలచియుండగ
మదిచెడి యొక క్రూరవిటుడు మానక తిరుగున్
బొది జిలుక పిల్లి పట్టిన
జదువునె యా పంజరమున జగతిని సుమతీ!" ,

@"మానఘనుఁ డాత్మధృతిఁ జెడి
హీనుండగువాని నాశ్రయించుట యెల్లన్
మానెడు జలములలోపల
నేనుఁగు మెయి దాఁచినట్టు లెరగుము సుమతీ!" ,

@"మాటకు బ్రాణము సత్యము
కోటకుఁ బ్రాణంబు సుభట కోటి ధరిత్రిన్
బోటికిఁ బ్రాణము మానము
చీటికిఁ బ్రాణంబు వ్రాలు సిద్ధము సుమతీ!" ,

@"మంత్రిగలవాని రాజ్యము
తంత్రము సెడకుండ నిలచుఁ దరచుగ ధరలో
మంత్రి విహీనుని రాజ్యము
జంత్రపుఁగీలూడినట్లు జరుగదు సుమతీ!" ,

@"మండలపతి సముఖంబున
మెండైన ప్రధానిలేక మెలఁగుట యెల్లన్
గొండంత మదపుటేనుగు
తొండము లేకుండినట్లు తోచుర సుమతీ!" ,

@"బలవంతుడ నాకేమని
పలువురితో నిగ్రహించి పలుకుట మేలా
బలవంతమైన సర్పము
చలిచీమల చేత జిక్కి చావదె సుమతీ!" ,

@"బంగారు కుదువబెట్టకు
సంగరమునఁ బారిపోకు సరసుఁడవగుచో
నంగడి వెచ్చములాడకు
వెంగలితో జెలిమి వలదు వినురా సుమతీ!" ,

@"పొరుగున పగవాడుండిన
నిర వొందగ వ్రాతగాఁడె ఏలికయైనన్
ధరఁగాఁపు కొండెమాడినఁ
గరణాలకు బ్రతుకులేదు గదరా సుమతీ!" ,

@"పెట్టిన దినములలోపల
నట్టడవులకైనవచ్చు నానార్థములున్
బెట్టని దినములఁ గనకపు
గట్టెక్కిన నేమిలేదు గదరా సుమతీ!" ,

@"పులిపాలు దెచ్చిఇచ్చిన
నలవడఁగ గుండెగోసి యరచే నిడినం
దలపొడుగు ధనము బోసిన
వెలయాలికి గూర్మిలేదు వినురా సుమతీ!" ,

@"పుత్రోత్సాహము తండ్రికి
పుత్రుడు జన్మించినపుడు పుట్టదు, జనులా
పుత్రుని కనుగొని పొగడగ
పుత్రోత్సాహంబు నాడు పొందుర సుమతీ!" ,

@"పురికిని బ్రాణము కోమటి
వరికిని బ్రాణంబు నీరు వసుమతిలోనం
గరికిని బ్రాణము తొండము
సిరికిని బ్రాణము మగువ సిద్ధము సుమతీ!" ,

@"పిలువని పనులకు బోవుట
కలయని సతి రతియు రాజు గానని కొలువు
బిలువని పేరంటంబును
వలవని చెలిమియును జేయవలదుర సుమతీ" ,

@"పాలసునకైన యాపద
జాలింబడి తీర్పఁదగదు సర్వజ్ఞునకుఁ
దే లగ్నిబడగఁ బట్టిన
మేలెరుగునె మీటుగాక మేదిని సుమతీ!" ,

@"పాలను గలిసిన జలమును
బాలవిధంబుననే యుండుఁ బరికింపగ
బాల చవిఁజెరచు గావున
బాలసుఁడగువాని పొందు వలదుర సుమతీ!" ,

@"పాటెరుగని పతికొలువును
గూటంబున కెరుకపడని కోమలిరతియు
జేటెత్తజేయు చెలిమియు
నేటికి నెదిరీదినట్టు లెన్నగ సుమతీ" ,

@"పలుదోమి సేయు విడియము
తలగడిగిన నాఁటినిద్ర తరుణులయెడలం
బొలయలుక నాటి కూటమి
వెల యింతని చెప్పరాదు వినురా సుమతీ !" ,

@"పర్వముల సతులఁ గవయకు
ముర్వీశ్వరుకరుణ నమ్మి యబ్బకు మదిలో
గర్వింపనాలి బెంపకు
నిర్వహణము లేనిచోట నిలువకు సుమతీ !" ,

@"పరుల కనిష్టము సెప్పకు
పొరుగిండ్లకు బనులులేక పోవకు మెపుడున్
బరుఁగదిసిన సతి గవయకు
ఎరింగియు బిరుసై సహయము నెక్కకు సుమతీ !" ,

@"పరసతుల గోష్టినుండి
పురుషుడు గాంగేయుడైన భువి నిందబడున్
బరుసతి సుశీయైనను
బరుసంగతినున్న నింద పాలగు సుమతీ !" ,

@"పరసతి కూటమి గోరకు
పరధనముల కాసపడకు పరునెంచకుమీ
సరిగాని గోష్టి సేయకు
సిరిచెడి జుట్టంబుకడకుఁ జేరకు సుమతీ !" ,

@"పరనారీ సోదరుఁడై
పరధనముల కాసపడక పరులకు హితుడైఁ
పరుల దనుఁబొగడ నెగడక
పరుఁలలిగిన నలుగనతఁడు పరముడు సుమతీ !" ,

@"పనిచేయునెడల దాసియు
ననుభవమున రంభ మంత్రి యాలోచనలన్
దనభుక్తి యెడలఁ దల్లియు
ననఁ దన కులకాంత యుండనగురా సుమతీ !" ,

@"పతికడకుఁ దన్నుగూర్చిన
సతికడకును వేల్పుకడకు సద్గురు కడకున్
సుతుకడకు రిత్తచేతుల
మతిమంతులు చనరు నీతిమార్గము సుమతీ !" ,

@"పగవల దెవ్వరితోడను
వగవంగా వలదు లేమి వచ్చిన పిదపన్
దెగనాడవలదు సభలను
మగువకు మనసీయవలదు మహిలో సుమతీ !" ,

@"నవ్వకుమీ సభలోపల
నవ్వకుమీ తల్లిదండ్రి నాధులతోడన్
నవ్వకుమీ పరసతితో
నవ్వకుమీ విప్రవరుల నయమిది సుమతీ !" ,

@"నవరస భావాలంకృత
కవితాగోష్ఠియును మధుర గానంబును
నవివేకి కెంతఁజెప్పినఁ
జెవిటికి శంఖూదినట్లు సిద్ధము సుమతీ !" ,

@"నరపతుల మేరదప్పిన
దిర మొప్పగ విధవ ఇంట దీర్పరియైనన్
గరణము వైదికుఁడయినను
మరణాంతకమౌనుగాని మానదు సుమతీ !" ,

@"నవమున బాలుంద్రావరు
భయమునను విషమ్మునైన భక్షింతురుగా
నయమెంత దోసకారియె
భయమే చూపంగవలయు బాగుగ సుమతీ !" ,

@"నమ్మకు సుంకరి జూదరి
నమ్మకు మగసాలివాని నటు వెలయాలిన్
నమ్మకు మంగలివానిని
నమ్మకుమీ వామహస్తు నవనిని సుమతీ !" ,

@"నడువకుమీ తెరువొక్కటఁ
గుడువకుమీ శతృనింటఁ గూరిమితోడన్
ముడువకుమీ పరధనముల
నుడువకుమీ యెరులమనసు నొవ్వగ సుమతీ !" ,

@"సారంబగు నారికేళ సలిలము భంగిన్
గారవమును మరిమీదట
భూరిసుఖావహము నగును భువిలో సుమతీ !" ,

@"ధనపతి సఖుఁడై యుండియు
నెనయంగా శివుఁడు భిక్షమెత్తగవలసెన్
దనవారి కెంతకల గిన
దనభాగ్యమె తనఁకుగాక తథ్యము సుమతీ !" ,

@"చేతులకు దొడవు దానము
భూతలనాధులకుఁ దొడవు బొంకమి ధరలో
నీతియ తొడ వెవ్వారికి
నాతికి మానంబు తొడవు నయముగ సుమతీ !" ,

@"దగ్గర కొండెము సెప్పెడు
ప్రెగ్గడ పలుకులకు రాజు ప్రియుఁడై మరితా
నెగ్గుఁబ్రజ కాచరించుట
బొగ్గులకై కల్పతరువు బొడచుట సుమతీ !" ,

@"తాను భుజింపని యర్థము
మానవపతిఁ జేరుఁగొంత మరి భూగతమౌఁ
గానల నీఁగల గూర్చిన
దేనియ యెరుఁజేరునట్లు తిరగమున సుమతీ !" ,

@"తలమాసిన నొలుమాసిన
వలువలు మాసినను బ్రాన వల్లభునైనం
గులకాంతలైన రోఁతురు
తిలకింపఁగ భూమిలోన దిరముగ సుమతీ !" ,

@"తలనుండు విషము ఫణికిని
వెలయంగా దోకనుండు వృశ్చికమునకున్
దలతోఁక యనక యుండును
ఖలునకు నిలువెల్ల విషము గదరా సుమతీ !" ,

@"తములము వేయని నోరును
విమతులతో జెలిమిసేసి వెతఁబడు తెలివిన్
గమలములు లేని కొలకుఁను
హిమధాముఁడు లేని రాత్రి హీనము సుమతీ !" ,

@"తనవారు లేనిచోటను
జనవించుక లేనిచోట జగడముచోటన్
అనుమానమైన చోటను
మనుజునకును నిలువఁదగదు మహిలో సుమతీ !" ,

@"తన కలిమి ఇంద్రభోగము
తన లేమియె సర్వలోక దారిద్య్రంబున్
తన చావు జతద్ప్రళయము
తను వలచినదియె రంభ తథ్యము సుమతీ !" ,

@"తనయూరి తపసితనమును
దనపుత్త్రుని విద్య పెంపుఁ దన సతి రూపున్
దన పెరటిచెట్టు మందును
మనసున వర్ణింప రెట్టి మనుజులు సుమతీ !" ,

@"తన కోపమె తన శతృవు
తన శాంతమె తనకు రక్ష దయ చుట్టంబౌఁ
తన సంతోషమె స్వర్గము
తన దుఃఖమె నరకమండ్రు తధ్యము సుమతీ !" ,

@"తడ వోర్వక యొడలోర్వక
కడువేగం బడచిపడినఁ గార్యంబగునే
తడవోర్చిన నొడలోర్చినఁ
జెడిపోయిన కార్యమెల్ల జేకురు సుమతీ !" ,

@"చేతులకు దొడవు దానము
భూతలనాధులకుఁ దొడవు బొంకమి ధరలో
నీతియ తొడ వెవ్వారికి
నాతికి మానంబు తొడవు నయముగ సుమతీ !" ,

@"చుట్టములు గానివారలు
చుట్టములము నీకటంచు సొంపుదలర్పన్
నెట్టుకొని యాశ్రయింతురు
గట్టిగఁ ద్రవ్యంబు గలుగఁ గదరా సుమతీ !" ,

@"కొరగాని కొడుకు పుట్టినఁ
కొరగామియె కాదు తండ్రి గుణముల జెరచుం
జెరకు తుద వెన్నుఁపుట్టిన
జెరకునఁ దీపెల్ల జెరచు సిద్ధము సుమతీ !" ,

@"కోమలి విశ్వాసంబును
బాములతోఁ జెలిమి యన్యభామల వలపున్
వేముల తియ్యఁదనంబును
భూమీశుల నమ్మికలుసు బొంకుర సుమతీ !" ,

@"గడనగల మననిఁజూచిన
నడుగగడుగున మడుఁగులిడుచు రతివలు తమలో
గడ నుడుగు మగనిఁ జూచిన
నడుపీనుఁగు వచ్చెననుచు నగుదురు సుమతీ !" ,

@"చీమలు పెట్టిన పుట్టలు
పాముల కిరవైన యట్లు పామరుఁడు దగన్
హేమంబుఁ గూడఁబెట్టిన
భూమీశులపాఁ జేరు భువిలో సుమతీ !" ,

@"గలహింపకు వట్టి తప్పు ఘటియింపకుమీ
కలకంఠి కంట కన్నీ
రొలికిన సిరి యింటనుండ నొల్లదు సుమతీ!" ,

@"కూరిమిగల దినములలో
నేరము లెన్నఁడును గలుఁగ నేరవు మఱి యా
కూరిమి విరసంబైనను
నేరములే తోఁచుచుండు నిక్కము సుమతీ!" ,

@"కొంచెపు నరుసంగతిచే
నంచితముగఁ గీడువచ్చు నదియెట్లన్నన్
గించిత్తు నల్లి కుట్టిన
మంచమునకుఁ జేటువచ్చు మహిలో సుమతీ!" ,

@"కారణములేని నగవును
బేరణమును లేని లేమ పృథివీస్థలిలో
బూరణము లేని బూరెయు
వీరణములేని పెండ్లి వృధరా సుమతీ!" ,

@"కాముకుడు దనిసి విడిచిన
కోమలి బరవిటుడు గవయ గూడుట యెల్లన్
బ్రేమమున జెరకు పిప్పికి
జీమలు వెస మూగినట్లు సిద్ధము సుమతీ!" ,

@"కాదు సుమీ దుస్సంగతి
పోదుసుమీ కీర్తికాంత పొందిన పిదపన్
వాదుసుమీ యప్పిచ్చుట
లేదుసుమీ సతులవలపు లేశము సుమతీ!" ,

@"కవిగానివాని వ్రాఁతయు
నవరసభావములు లేని నాతుల వలపుం
దవిలి చను పందినేయని
వివిధాయుధ కౌశలంబు వృథరా సుమతీ!" ,

@"కసుగాయఁ గరచి చూచిన
మసలక తన యోగరుగాక మధురంబగునా?
పసగలుగు యువతులుండఁగఁ
బసిబాలలఁ బొందువాఁడు పశువుర సుమతీ!" ,

@"కరణము సాధై యున్నను
గరి మద ముడిగినను బాము కరవకయున్నన్
ధరదేలు మీటకున్నను
గర మరుదుగ లెక్క గొనరు గదరా సుమతీ!" ,

@"కరణము గరణము నమ్మిన
మరణాంతకమౌను గాని మనలేడు సుమీ
కరణము తన సరి కరణము
మరి నమ్మక మర్మమీక మనవలె సుమతీ!" ,

@"కమలములు నీడఁ బాసినఁ
గమలాప్తుని రశ్మి సోకి కమలినభంగిన్
దమ దమ నెలవులు దప్పినఁ
దమ మిత్రులు శతృలౌట తథ్యము సుమతీ!" ,

@"కప్పకు నొరగాలైనను
సప్పమునకు రోగమైన సతి తులువైనన్
ముప్పున దరిద్రుడైనను
దప్పదు మరి దుఃఖమగుట తథ్యము సుమతీ!" ,

@"కనకపు సింహాసనము
శునకముఁ గూర్చుండబెట్టి శుభలగ్నమునఁ
దొనరఁగ బట్టముగట్టిన
వెనకటి గుణమేల మాను వినరా సుమతీ!" ,

@"కడు బలవంతుడైనను
బుడమిని బ్రాయంపుటాలి బుట్టినయింటం
దడవుండనిచ్చె నేనియు
బడుపుగ నంగడికి దానె పంపుట సుమతీ!" ,

@"ఓడల బండ్లును వచ్చును
ఓడలు నాబండ్ల మీద నొప్పుగ వచ్చును
ఓడలు బండ్లును వలెనే
వాడంబడు గలిమిలేమి వసుధను సుమతీ!" ,

@"ఒల్లనిసతి నొల్లనిపతి
నొల్లని చెలికాని విడువ నొల్లనివాఁడే
గొల్లండు గాక ధరలో
గొల్లండును గొల్లడౌను గుణమున సుమతీ!" ,

@"ఒకయూరికి నొక కరణము
నొక తీర్పరియైనఁ గాక వొగిఁదరుచైనం
గకవికలు గాక యుండునె
సకలంబును గొట్టువడక సహజము సుమతీ!" ,

@"ఏరకుమీ కసుగాయలు
దోరకుమీ బంధుజనుల దోషముసుమ్మీ
పారకుమీ రణమందున
మీరకుమీ గురువులాజ్ఞ మేదిని సుమతీ!" ,

@"ఎప్పుడు సంపద కలిగిన
అప్పుడె బంధువులు వత్తురది యెట్లన్నన్
దెప్పలుగ జెరువునిండిన
గప్పలు పదివేలు చేరు గదరా సుమతీ!" ,

@"ఎప్పుడు దప్పులు వెదకెడు
నప్పురుషుని కొల్వ గూడ దదియెట్లన్నన్
సర్పంబు పడగనీడను
గప్పవసించిన విధంబు గదరా సుమతీ!" ,

@"ఉపకారికి నుపకారము
విపరీతముగాదు సేయ వివరింపంగా
అపకారికి నుపకారము
నెపమెన్నక సేయువాడు నేర్పరి సుమతీ!" ,

@"ఉదకము ద్రావెడు హయమును
మదమున నుప్పొంగుచుండు మత్తేభంబున్
మొదవుకడ నున్న వృషభము
జదువని యా నీచుకడకుఁ జనకుర సుమతీ!" ,

@"ఉత్తమ గుణములు నీచు
కెత్తెర గునగలుగనేర్చు నెయ్యడలం దా
నెత్తిచ్చి కరగిపోసిన
నిత్తడి బంగారుమగునె ఇలలో సుమతీ!" ,

@"ఉడుముండదె నూరేండ్లును
బడియుండదె పేర్మి బాము పదినూరేండ్లున్
మడుపునఁ గొక్కెర యుండదె
కడు నిల బురుషార్థపరుడు గావలె సుమతీ!" ,

@"ఇమ్ముగఁ జదువని నోరును
అమ్మాయని పిలిచి యన్నమడుగని నోరున్
దమ్ములఁ బిలువని నోరును
గుమ్మరిమను ద్రవ్వినట్టి గుంటర సుమతీ!" ,

@"ఆఁకొన్న కూడె యమృతము
తాఁకొందక నిచ్చువాఁడె దాత ధరిత్రిన్
సోఁకోర్చువాఁడె మనుజుఁడు
తేఁకువగలవాఁడె వంశ తిలకుఁడు సుమతీ!" ,

@"అల్లుని మంచితనంబును
గొల్లని సాహిత్యవిద్య, కోమలి నిజమున్
బొల్లున దంచిన బియ్యముఁ
దెల్లని కాకులును లేవు తెలియర సుమతీ!" ,

@"అప్పుగొని సేయు విభవము
ముప్పునఁ బ్రాయంపుటాలు మూర్ఖుని తపమున్
దప్పురయని నృపురాజ్యము
దెప్పరమై మీఁదఁ గీడు దెచ్చుర సుమతీ!" ,

@"అడియాస కొలువుఁ గొలువకు
గుడిమణియము సేయఁబోకు కుజనులతోడన్
విడువక కూరిమి సేయకు
మడవినిఁదో డరయఁకొంటి నరుగకు సుమతీ!" ,

@"అడిగిన జీతంబియ్యని
మిడిమేలపు దొరనుగొల్చి మిడుకుటకంటెన్
వడిగల యెద్దుల గట్టుక
మడి దున్నుకు బ్రతుకవచ్చు మహిలో సుమతీ!" ,

@"అక్కరకు రాని చుట్టము,
మ్రొక్కిన వరమీని వేల్పు మోహరమునఁదా
నెక్కినఁ బారని గుర్రము,
గ్రక్కున విడువంగ వలయుఁ గదరా సుమతీ!" ,

@"శ్రీరాముని దయచేతను
నారూఢిగ సకలజనులు నౌరాఁయనగా
ధారాళమైన నీతులు
నోరూరఁగఁ జవులుపుట్ట నుడివెద సుమతీ!" ,

				};
			}
		}
	}
}
