//---------------------------------------------------------------------------------------------
// <copyright file="Vemana.cs" company="Chandam-ఛందం">
//    Copyright © 2013 - 2018 'Chandam-ఛందం' : http://chandam.apphb.com
//    Original Author : Dileep Miriyala (m.dileep@gmail.com)
//    Last Updated    : 03-Feb-2018 21:34EST
//    Revisions:
//       Version    | Author                   | Email                     | Remarks
//       1.0        | Dileep Miriyala          | m.dileep@gmail.com        | Initial Commit
//       _._        | <TODO>                   |   <TODO>                  | <TODO>
// </copyright>
//---------------------------------------------------------------------------------------------

namespace Chandam.Samples
{
	public class Vemana : SamplePoems
	{
		public override string[] Poems
		{
			get
			{
				return new string[]{
@"గంగిగోవు పాలు గరిటడైనను చాలు
కడివెడైన నేల ఖరముపాలు
భక్తికలుగు కూడు పట్టెడైననుజాలు
విశ్వదాభిరామ వినుర వేమ" ,

@"ఆత్మ శుద్దిలేని యాచార మదియేల
భాండ సుద్దిలేని పాకమేల
చిత్తశుద్దిలేని శివపూజ లేలరా
విశ్వదాభి రామ వినుర వేమ" ,

@"అల్పుడెపుడు బల్కు నాడంబరముగాను
సజ్జనుండు పలుకు చల్లగాను
కంచు మ్రోగినట్లు కనకంబు మ్రోగునా
విశ్వదాభిరామ వినురవేమ." ,

@"అనగ ననగ రాగ మతిశయిల్లుచునుండు
తినగ తినగ వేము తీయగుండు
సాధనమున పనులు సమకూరు ధరలోన
విశ్వదాభిరామ వినుర వేమ" ,

@"ఇనుము విరిగెనేని యినుమారు ముమ్మారు
కాచి యతుకనేర్చు గమ్మరీడు
మనసు విరిగినేని మరియంట నేర్చునా?
విశ్వదాభిరామ వినురవేమ" ,

@"ఎలుగుతోలు తెచ్చి యెన్నాళ్ళు నుదికిన
నలుపు నలుపెకాని తెలుపు కాదు
కొయ్యబొమ్మదెచ్చి కొట్టిన పలుకునా?
విశ్వదాభిరామ వినురవేమ" ,

@"ఆపదైన వేళ నరసి బంధుల జూడు
భయమువేళ జూడు బంటుతనము
పేదవేళ జూడు పెండ్లాము గుణమును
విశ్వదాభిరామ వినురవేమ" ,

@"చిప్పలోనబడ్డ చినుకు ముత్యంబయ్యె
నీట బడ్డ చినుకు నీట గలిసె 
బ్రాప్తి గలుగు చోట ఫలమేల తప్పురా
విశ్వదాభిరామ వినురవేమ" ,

@"చిక్కియున్న వేళ సింహంబునైనను
బక్కకుక్క కరచి బాధచేయు
బలిమి లేనివేళ బంతంబు చెల్లదు
విశ్వదాభిరామ వినురవేమ" ,

@"కులములోన నొకడు గుణవంతుడండిన
కులము వెలయు వాని గుణము చేత
వెలయు వనములోన మలయజంబున్నట్లు
విశ్వదాభిరామ వినురవేమ." ,

@"తలపులోన గలుగు దా దైవమే ప్రొద్దు
తలచి చూడనతకు తత్వమగును
వూఱకుండ నేర్వునుత్తమ యోగిరా
విశ్వదాభిరామ వినుర వేమ!" ,

@"తన విరక్తి యనెడి దాసి చేతను జిక్కి
మిగిలి వెడలవేక మిణుకుచున్న
నరుడి కేడముక్తి వరలెడి చెప్పడీ
విశ్వదాభిరామ వినుర వేమ!" ,

@"తనదు మనసుచేత దర్కించి జ్యోతిష
మెంత చేసె ననుచు నెంచి చూచు,
తన యదృష్టమంత దైవ మెఱుంగడా?
విశ్వదాభిరామ వినుర వేమ!" ,

@"టీక వ్రాసినట్లనేకులు పెద్దలు
లోకమందు జెప్పి మంచు
కాకులట్టి జనుల కానరీ మర్మము
విశ్వదాభిరామ వినుర వేమ!" ,

@"జ్ఞానమెన్న గురువు జ్ఞానహైన్యము బుద్ధి
రెంటినందు రిమ్మరేచునపుడు
రిమ్మ తెలిపెనేని రెండొక రూపురా
విశ్వదాభిరామ వినుర వేమ!" ,

@"జాణలమని యంద్రు చపలాత్ములగువారు
తెలివిలేక తమ్ముతెలియలేరు
కష్టమైన యడవి గాసీలుచున్నారు
విశ్వదాభిరామ వినుర వేమ!" ,

@"జనన మరణములన స్వప్న సుషుప్తులు
జగములందు నెండ జగములుండు
నరుడు జగమునంట నడుబాటు కాదొకో
విశ్వదాభిరామ వినుర వేమ!" ,

@"ఛాయననొసగుచెట్లు సాధువు బోధట్టు
లడగి దరినిజేరి పడయవచ్చు
నట్టునిట్టు దాటనది పోవునిది రామ
విశ్వదాభిరామ వినుర వేమ!" ,

@"నరుడెయైన లేక నారాయణుండైన
తత్త్వబద్ధుడైన దరణి నరయ
మరణమున్నదనుచు మదిని నమ్మగవలె
విశ్వదాభిరామ వినుర వేమ!" ,

@"ద్వారబంధమునకు దలుపులు గడియలు
వలెనె నోటికొప్పుగల నియతులు
ధర్మమెరిగి పలుక ధన్యుండౌ భువిలోన
విశ్వదాభిరామ వినురవేమ" ,

@"బ్రహ్మఘటము మేను ప్రాణంబు తగగాలి
మిత్రచంద్ర శిఖులు నేత్రచయము
మఱియు బ్రహ్మమనగ మహిమీద లేదయా
విశ్వదాభిరామ వినురవేమ" ,

@"యోగిననుచు గొంత యోగముగూర్చక
జగమునెల్లబట్ట చంపి తినుచు
ధనము కొఱకు వాడు తగవాడుచుండిన
యోగికాడు వాడె యోగువేమ" ,

@"అర్ధ యంకణమున కాధారమైనట్టి
యొంటిమేడ గుంజు నొనరనిల్పె
నింటికొక మగండె యిల్లాండ్రునేద్గురు
విశ్వదాభిరామ వినురవేమ" ,

@"అన్నదానమునకు నధిక సంపదగల్గి
యమరలోక పూజ్యుడగును మీఱు
అన్నమగును బ్రహ్మమది కనలేరయా
విశ్వదాభిరామ వినురవేమ" ,

@"బొంది యెవరి సొమ్ము పోషింపబలుమారు 
ప్రాణ మెవరి సొమ్ము భక్తిసేయ,
ధనమదెవరిసొమ్ము ధర్మమె తన సొమ్ము
విశ్వదాభిరామ వినురవేమ" ,

@"పండువలన బుట్టె బరగ ప్రపంచము
పండువలన బుట్టె పరము నిహము
పండు మేలెఱింగె బ్రహ్లాదుడిలలోన
విశ్వదాభిరామ వినురవేమ" ,

@"తపమువేల? యరయ ధాత్రిజనులకెల్ల
నొనర శివుని జూడ నుపమ గలదు
మనసు చదరనీక మహిలోన జూడరా
విశ్వదాభిరామ వినుర వేమ!" ,

@"తనగుణము తనకు నుండగ
నెనయంగా నోరుని గుణము నెంచును మదిలో
దన గుణము తెలియ కన్యుని
బనిగొని దూషించువాడు వ్యర్థుడు వేమ!" ,

@"జాలినొందరాదు జవదాటి కనరాదు
అది మూలమైన ఆత్మమఱుగు
పోరిచేరి పొంది పూర్ణము నందురా
విశ్వదాభిరామ వినుర వేమ!" ,

@"జాతి, మతము విడిచి చని యోగికామేలు
జాతితో నెయున్న నీతివలదె
మతముబట్టి జాతి మానకుంట కొఱంత
విశ్వదాభిరామ వినుర వేమ!" ,

@"నీవనినను నేననినను
భావమ్మున నెఱుకయొక్క పద్ధతియగునా
భావంబు దెలిసి మదిని
ర్భావముగా నిన్ను గనుట పరమగు వేమా" ,

@"నీళ్ల మునుగునేల? నిధుల మెట్టగనేల
మొనసి వేల్పులకును మ్రొక్కనేల
కపట కల్మషములు కడుపులో నుండగా
విశ్వదాభిరామ వినుర వేమ!" ,

@"పంచ ముఖములందు బంచాక్షరి జనించె
పంచ వర్ణములను ప్రబలె జగము
పంచముఖుని మీరు ప్రస్తుతి చేయుడీ
విశ్వదాభిరామ వినురవేమ" ,

@"నేయి వెన్న కాచి నీడనే యుంచిన
బేరి గట్టిపడును పెరుగురీతి
పోరిపోరి మదిని పోనీక పట్టుము
విశ్వదాభిరామ వినురవేమ" ,

@"మంటికుండవంటి మాయ శరీరంబు
చచ్చునెన్నడైన, చావదాత్మ
ఘటములెన్నియైన గగనమొకటెగద,
విశ్వదాభిరామ వినుర వేమ!" ,

@"మంట లోహమందు మ్రాకుల శిలలందు
పటములందు గోడ ప్రతిమలందు
తన్నుదెలియు కొఱకుదగులదా పరమాత్మ
విశ్వదాభిరామ వినుర వేమ!" ,

@"నిమిషమైనను మది నిల్చి నిర్మలముగ
లింగ జీవావేశులను గాంచి భంగపడక
పూజ మదియందు జేరుట పూర్ణపదవి
పరము గోరిన నిదిచేయ బాగువేమా" ,

@"ధూమాదుల నావృతమై
వ్యోమంబునకెగని కలియు నుపములు తనలో
శ్రీమించు శివుని జేరును
గామాదుల గలియడతడు ఘనముగ వేమా" ,

@"పగలుడుగ నాసలుడుగును
వగపుడుగం గోర్కెలుడుగు వడి జన్మంబుల్‌
తగులుడుగు భోగముడిగిన 
త్రిగుణంబును నడుగ ముక్తి తెరువగు వేమా!" ,

@"పాల నీటి కలత పరమహంస మెఱుగు
నీరు పాలు నెట్లు నేర్చునెమలి
లజ్ఞుడైన హీనుడల శివు నెఱుగునా?
విశ్వదాభిరామ వినుర వేమ!" ,

@"పుట్టు పుట్టలేదె పుడమిని జనులెల్ల
పుట్టి గిట్టలేదె పూర్వులెవరు
పుట్టి గిట్టుటెల్ల వట్టి భ్రాంతులు సుమీ,
విశ్వదాభిరామ వినుర వేమ!" ,

@"పరుల విత్తమందు భ్రాంతి వాసినయట్టి
పురుషుడవనిలోన పుణ్యమూర్తి
పరుల విత్తమరయ పాపసంచితమగు
విశ్వదాభిరామ వినుర వేమ!" ,

@"పరధనంబులకును ప్రాణములిచ్చును
సత్యమంతలేక జారడగును 
ద్విజులమంచు నింత్రుతేజమించుకలేదు
విశ్వదాభిరామ వినుర వేమ!" ,

@"నోరు పలకవచ్చు నుడి వ్రాయగర్రాదు 
వ్రాతకన్న సాక్షి వలవదన్న
పరగలేని వ్రాత భంగ పాటుందెచ్చు
విశ్వదాభిరామ వినుర వేమ!" ,

@"నిజము,కల్ల రెండు నీలకంఠుడెఱుంగు
నిజములాడకున్న నీతిదప్పు
నిజములాడునపుడు నీ రూపమనవచ్చు
విశ్వదాభిరామ వినుర వేమ!" ,

@"దశగలారినెల్ల దమ బంధువు లటండ్రు
దశయలేమి నెంత్రు తక్కువగను
దశయన గమ ధన దశమొక్కటే దశ
విశ్వదాభిరామ వినుర వేమ!" ,

@"తామసించి చేయదగ దెట్టి కార్యంబు
వేగిరింప నదియు విషమగును
పచ్చికాయదెచ్చి పడవేయ ఫలమౌనే
విశ్వదాభిరామ వినుర వేమ!" ,

@"తల్లిబిడ్డలకును తగవు పుట్టించెడి
ధనము సుఖము గూర్చునని గడింత్రు
కాని యెల్లయెడల ఘన దుఃఖన్‌దమది
విశ్వదాభిరామ వినుర వేమ!" ,

@"తల్లిదండ్రులెన్నదగు తొలి గురువులు
పార్వతీభవు లిలబరమగురులు
కూలివాండ్ర జగతి గురులన ద్రోహము
విశ్వదాభిరామ వినుర వేమ!" ,

@"తామసించి చేయదగ దెట్టి కార్యంబు
వేగిరింప నదియు విషమగును
పచ్చికాయదెచ్చి పడవేయ ఫలమౌనే
విశ్వదాభిరామ వినుర వేమ!" ,

@"పుట్టు పుట్టలేదే పుడమిని జనులెల్ల
పుట్టి గిట్టలేదె పూర్వులెవరు
పుట్టి గిట్టుటెల్ల వట్టి భ్రాంతులు సుమీ,
విశ్వదాభిరామ వినుర వేమ!" ,

@"పెట్టిపోయలేని వట్టి దేబెలు భూమి
బుట్టిరేమి వారు గిట్టరేమి
పుట్టలోని చెదలు పుట్టదా గిట్టదా!
విశ్వదాభిరామ వినుర వేమ!" ,

@"లోకమందుబుట్టి లోకమందె పెరిగి
లోక విభవమోర్వలేక జనుడు
లోకమందు జనికి లోబడి చెడిపోవును
విశ్వదాభిరామ వినుర వేమ!" ,

@"మది గలిగిన పూజ మదనారి మెచ్చును
మనసు నిల్సినంత మహితుడగును
మనసులేని పూజ మట్టి సమానము
విశ్వదాభిరామ వినుర వేమ!" ,

@"తామును జనులేమను కొన
బూనుదురో దాని సరసి పొందిన జడనీ,
రాని పధంబున నడిచిన
దాననె ధర్మాత్ముడండ్రు తన్నిట వేమా!" ,

@"మదము వలన గలుగు మాటలు మఱిపల్కి
మ్రుచ్చు సద్దులనొగి మోసపుచ్చి
కాసురాబెనగెడు కష్ఠుండు గురుడౌనే?
విశ్వదాభిరామ వినుర వేమ!" ,

@"మనసే మాయా మృగమౌ
మననేమిటి పైకిగానీ మణిపోనీకా
మనసున మనసును జంపిన
మనందే ముక్తిగలదు మహిలో వేమా!" ,

@"మంత్రమొకటి చెప్పి మఱి దేవతార్చన
చేసి తమకుగరుణచెందినదని
వేదపఠన చేసి వెఱ్ఱులై పోదురు,
విశ్వదాభిరామ వినుర వేమ!" ,

@"మఠములోనియోగి మాయలన్నియుగోసి
ఘటములోన నున్న ఘనునిదెలిసి
మాట మాటకుగురు మరువక తెలుపురా,
విశ్వదాభిరామ వినుర వేమ!" ,

@"తిరిగి వచ్చువేళ మరలిపోయెడి వేళ
వెంట దేరు ధనము వంటబోరు
తొనెటకు జనునొ ధనమెందు బోవునో
విశ్వదాభిరామ వినుర వేమ!" ,

@"ఆశయనెడు దాని గోసివేయగాలేక
మొహబుద్ది వలన మునుగువారు
కాశివాసులైన గనబోరు మోక్షము
విశ్వదాభిరామ వినుర వేమ!" ,

@"చిత్తమనేడి వేరే శిథిలమైనప్పుడే
ప్రకృతి యనెడి చెట్టు పడును పిదప
గోర్కులనెడి పెద్దకొమ్మలెండును గదా
విశ్వదాభిరామ వినుర వేమ!" ,

@"భోగంబుల కాశింపక
రాగద్వేషంబు రంగుడదమలో
వేగమె మోక్ష పదంబును
రాగను నాతండు యోగిరాయుడు వేమా!" ,

@"చనువారెల్లను జనులం
జనిపోయిన వారి పుణ్య సత్కథలెల్లన్‌
వినవలె గనవలె మనవలె
నని మషులకు దెలుసగూడ దంత్యము వేమా!" ,

@"ఆశయనెడి త్రాళ్ళ నఖిల జనంబులు
కట్టుపడుచు ముక్తిగానరైరి
జ్ఞానఖడ్గమునను ఖండింప రాదొకో
విశ్వదాభిరామ వినుర వేమ!" ,

@"అతిథి రాక చూచి యదలించి పడవైచి
కఠిన చితులగుచు గానలేరు
కర్మమునకు ముందు ధర్మము గానరో
విశ్వదాభిరామ వినుర వేమ!" ,

@"తను వలచిన దావలచును తను
వలవక యున్ననెనడు తావలవ డిలన్‌
తనదు పటాటోపంబులు తన
మాయలు పనికిరావు ధరలోన వేమా!" ,

@"మాటలాడ వచ్చు మనసు నిల్వగలేదు
తెలుపవచ్చు దన్ను తెలియలేదు
సురియబట్టవచ్చు శూరుడు కాలేడు
విశ్వదాభిరామ వినురవేమ" ,

@"తనకేనాడు సుభిక్షము
తనకేనాడును భగంబు తనరవయునం
చును తన దశకై యెల్లెడ
మనసందున జివుకుచుండు మహిలో వేమా!" ,

@"ఎండిన మా నొకటడవిని
మండిన నందగ్ని పుట్టి యూడ్చును చెట్లన్‌
దండిగల వంశమెల్లను
చండాలుండొకడు పుట్టి చదుపును వేమా!" ,

@"నిజము తెలిసియున్న సుజినుడానిజమునె
పలుకవలయుగాని పరులకొరకు
చావకూడ దింక నోపదవ్యం పల్క
విశ్వదాభిరామ వినురవేమ" ,

@"తామును జనులేమను కొన
బూనుదురో దాని సరసి పొందిన జడనీ,
రాని పధంబున నడిచిన
దాననె ధర్మాత్ముడండ్రు తన్నిట వేమా!" ,

@"వినియు వినకయుండు కనియు గనక యుండు
తలచి తలపకుండు తాను యోగి
మనుజవరులచేత మణిపూజ గొనుచుండు
విశ్వదాభిరామ వినురవేమ!" ,

@"వెన్న చేతబట్టి వివరంబు తెలియక
ఘృతము కోరునట్టి యతని భండి
తాను దైవమయ్యు దైవంబు దలచును
విశ్వదాభిరామ వినురవేమ!" ,

@"రూపువంక పేరు రూఢిగా నిలుచును
పేరువంక క్రియలు పెనగుచుండు
నాశమౌను తుదకు నామరూప క్రియల్‌
విశ్వదాభిరామ వినురవేమ!" ,

@"లోభమోహములను ప్రాభవములు తప్పు
తలచిన పనులెల్ల తప్పి చనును
తానొకటి దలచిన దైవమొండగుచుండు
విశ్వదాభిరామ వినురవేమ" ,

@"శాంతమే జనులను జయమునొందించును
శాంతముననె గురువు జాడ తెలియు
శాంత భావ మహిమ జర్చింపలేమయా
విశ్వదాభిరామ వినురవేమ!" ,

@"వేషధారినెపుడు విశ్వసింపగరాదు
వేషదోషములొక విధయె యగును
రట్టుకాదె మునుపు రావణు వేషంబు
విశ్వదాభిరామ వినురవేమ!" ,

@"ఇంగలంబు తోడ నిల సల్పుతోడను
పరుని యాలితోడ పతితుతోడ
సరసమాడుటెల్ల చావుకు మూలము
విశ్వదాభిరామ వినురవేమ!" ,

@"ఐకమత్యమొక్క టావశ్యకం బెప్డు
దాని బలిమి నెంతయైన గూడు
గడ్డి వెంట బెట్టి కట్టరా యేనుంగు
విశ్వదాభిరామ వినురవేమ!" ,

@"తామసించి చేయదగదెట్టి కార్యంబు
వేగిరింప నదియు విషమగును
పచ్చికాయదెచ్చి పడవేయ ఫలమౌనా?
విశ్వదాభిరామ వినురవేమ!" ,

@"తల్లీ బిడ్డలకు తగవు పుట్టించెడి
ధనము సుఖము గూర్చునని గడింత్రు
కానీయెల్ల యెడల ఘన దుఃఖకరమది
విశ్వదాభిరామ వినురవేమ!" ,

@"దొంగమాటలాడ దొరుకునె మోక్షము
చేతగాని పలుకు చేటుదెచ్చు
గురువుపద్దు కాదు గునహైన్య మదియగు
విశ్వదాభిరామ వినుర వేమ!" ,

@"నలుగురు కల చోటను దా
దల చూపుచు మెలగుచుండి ధన్యాత గనగా
దలచెడి యాతడు నిచ్చలు
గల మాటలే పలుకుచుండగా దగు వేమా!" ,

@"నడుచునిచ్చు నతని బత్తెమిచ్చిన వాని
కడుపు చల్లజేసి ఘనత విడుచు
నడుప నేర నేర నతడు నాలి ముచ్చేగదా
విశ్వదాభిరామ వినురవేమ!" ,

@"పదుగురాడుమాట పాడియై ధరజెల్లు
నొక్కడాడుమాట యెక్కదెందు
వూరకుండు వాని కూరెల్ల నోపదు
విశ్వదాభిరామ వినురవేమ!" ,

@"పతక మందు నొప్పు పలు రత్నముల పెంపు
బంగరందు కూర్ప బరువు గనును
గాని యితర లోహమైన హీనము గాదె
విశ్వదాభిరామ వినురవేమ!" ,

@"జన్నములను మరియు జన్నియల ననేక
ముల నొనర్చియున్న ఫలముకాన
రాక యుండు నీతి లేకున్న మాత్రాన
విశ్వదాభిరామ వినురవేమ!" ,

@"తప్పు పలుకు పలికి తాతోట చేసిన
కూడియున లక్ష్మీ క్రుంగిపోవు
నోటికుండ నీళ్ళు నొనరగా నిలుచునా
విశ్వదాభిరామ వినుర వేమ!" ,

@"భూమి నాది యనిన భూమి ఫక్కున నవ్వు
దాన హీనుఁ జూచి ధనము నవ్వు
కదన భీతుఁ జూచి కాలుఁడు నవ్వును
విశ్వదాభిరామ వినురవేమ" ,

@"నీతి జ్యోతిలేక నిర్మలంబగు నేది
ఎట్లు కలగుబర మదెంతయైన
ధనము గలిగియున్న దైవంబు గలుగదు
విశ్వదాభిరామ వినుర వేమ!" ,

@"పగయుడగు గోపముడిగిన
పగయుడుగన్‌ కోర్కెలుడుగు బరజన్మంపుం
దగులుడుగు భేదముడిగిన
త్రిగుణము లుడుగంగ ముక్తి స్థిరమగు వేమా!" ,

@"పప్పులేని కూడు పరులకోసహ్యమే
యుప్పులేని వాడె యధిక బలుడు
ముప్పులేని వాడు మొదటి సుజ్జానిరా
విశ్వదాభిరామ వినురవేమ!" ,

@"నిక్కమైన మంచి నీలమొక్కటి చాలు
తళుకు బెళుకు రాలు తట్టెడేల
చదువ పద్యమరయ జాలదా యొక్కటి
విశ్వదాభిరామ వినుర వేమ!" ,

@"పరుల దత్తమొప్పి పాలనచేసిన
నిల స్వదత్తమునకు విను మడియగు
నవని పరుల దత్త మహపరింపగ రాదు
విశ్వధాబిరామ వినురవేమ!" ,

@"నిజములాడు వాని నిందించు జగమెల్ల
నిజము బల్కరాదు నీచులకడ
నిజ మహాత్ముగూడ నిజమాడవలయురా
విశ్వదాభిరామ వినుర వేమ!" ,

@"పదుగురాడుమాట పాడియై ధరజెల్లు
నొక్కడాడుమాట యెక్కదెందు
వూరకుండు వాని కూరెల్ల నోపదు
విశ్వదాభిరామ వినురవేమ!" ,

@"పరుల మేలు చూచి పలుగాకి వలె నెప్పు
వట్టి మాటలాడు వాడధముడు
అట్టి వాని బ్రతుకు టదియేల మంటికా
విశ్వధాబిరామ వినురవేమ!" ,

@"భయమంతయు దేహమునకె
భయ ముడిగిన నిశ్చయంబు పరమాత్మునకే
లయమంతయు జీవునకే
జయమాత్మకు ననుచు జగతిఁ జాటుర వేమా" ,

@"భూమి నాది యనిన భూమి ఫక్కున నవ్వు
దాన హీనుఁ జూచి ధనము నవ్వు
కదన భీతుఁ జూచి కాలుఁడు నవ్వును
విశ్వదాభిరామ వినురవేమ" ,

@"మాటజెప్ప వినని మనుజుడు మూర్ఖుడు
మాట విన్న నరుడు మానుడగును
మాట వినగ జెప్ప మానుట కూడదు
విశ్వదాభిరామ వినురవేమ!" ,

@"మనసు తెలిసి యొకని మాటకు బ్రతిచెప్ప
సంతసించు నతడు చాలమెచ్చు
మనసు దెలియకున్నడనియుచు ననునేదో
విశ్వదాభిరామ వినురవేమ!" ,

@"ఆలిమాటలు విని అన్నదమ్ముల రోసి
వేరేపోవువాడు వెర్రివాడు
కుక్కతోక పట్టి గోదారీదినా?
విశ్వదాభిరామ వినుర వేమ!" ,

@"జ్ఞానియైనవాని మానక పూజించు
మనుజుడెప్పుడు పరమునను ముదంబు
సుఖమునందుచుండుసూరులు మెచ్చగ
విశ్వదాభిరామ వినురవేమ!" ,

@"హాని కలుగబోదు హరిమది నెంచెడు
వాని కబ్దు పరము వసుధయందు
పూని నిష్ఠమీరి పొదలక యుండుము
విశ్వరాభిరామ వినురవేమ!" ,

@"అల్పుడెప్పుడు పలుకు నాడంబరముగాను
సజ్జనుండు పలుకు చల్లగాను
కంచు మోగినట్లు కనకంబు మోగునా
విశ్వదాభిరామ వినుర వేమ!" ,

@"న్యాయశాస్త్ర మరయ నన్యాయమున దించు
ధర్మశాస్త్ర మొసగు రుగ్మతంబు
జ్యోతిషము జనముల నీతుల దప్పించు
విశ్వదాభిరామ వినురవేమ!" ,

@"దేవుడనగ వేరే దేశముందున్నాడె
దేహితోడ నెపుడు దేహమందె
వాహనములనెక్కి పడిదోలుచున్నాడు
విశ్వదాభిరామ వినురవేమ" ,

@"భూమిలోన బుట్టు భూసారమెల్లను
తనువులోన బుట్టు తత్త్వమెల్ల
శ్రమలోన బుట్టు సర్వంబు తానౌను
విశ్వదాభిరామ వినురవేమ" ,

@"వ్రాతకంటె హెచ్చు పరమీదు దైవంబు
చేతకంటె హెచ్చు వ్రాత లేదు
వ్రాత కజుడు కర్త చేతకు దాకర్త
విశ్వదాభిరామ వినురవేమ!" ,

@"చిప్పలోనబడ్డ చినుకు ముత్యంబయ్యె
నీట బడ్డ చినుకు నీట గలిసె
బ్రాప్తి గలుగు చోట ఫలమేల తప్పురా
విశ్వదాభిరామ వినురవేమ!" ,

@"ఇంటి ఇంటిలోననీశ్వరుడుండగ
నంటి చూడలేక యడవులందు
నుంట మేటంచునుందురా జోగులై
విశ్వదాభిరామ వినురవేమ!" ,

@"చిత్తశుద్ధి కలిగిచేసిన పుణ్యంబు
కొంచెమైన నదియు కొదవగాదు
విత్తనంబు మర్రి వృక్షంబునకు నెంతో
విశ్వదాభిరామ వినుర వేమ!" ,

@"అగ్నిబానా మేసి యంబుధి నింకించు
రాముడవలి కేగ రాక, నిలిచి
చెట్లు గిరులు తెచ్చి సేతువు గట్టడా
విశ్వదాభిరామ వినురవేమ!" ,

@"ఐదు వేళ్లు బలిమి హస్తంబు పనిచేయు
నం దొకండు విడ్డ పొందు చెడును
స్వీయుడొకడు విడిన జెడుకదా పనిబల్మి
విశ్వదాభిరామ వినురవేమ!" ,

@"ఆత్మబుద్ధి వలన నఖిలంబ తానయ్యె
జీవబుద్ధి వలన జీవుడయ్యె
మోహబుద్ధిలయము ముందర గనుగొను
విశ్వదాభిరామ వినురమేమ!" ,

@"గుణములోగలవాని కులమెంచగానేల
గుణము కలిగెనేని కోటిసేయు
గణములేక యున్న గుడ్డిగవ్వయులేదు
విశ్వదాభిరామ వినురవేమ" ,

@"తల్లితండ్రులందు దయలేని పుత్రుండు
పుట్టనేమి? వాడు గిట్టనేమి?
పుట్టలోని చెదలు పుట్టదా గిట్టదా
విశ్వదాభిరామ వినురవేమ" ,

@"కోపమున ఘనత కొంచెమైపోవును
కోపమునను గుణము కొరతపడును
కోపమణచనేని కోరికలీడేరు
విశ్వదాభిరామ వినురవేమ" ,

@"ఎలుగు తోలు తెచ్చి ఏడాది యుతికినా
నలుపు నలుపె కాని తెలుపుకాదు
కొయ్యబొమ్మ తెచ్చి కొట్టితే గుణియోనె
విశ్వదాభిరామ వినురవేమ" ,

@"అల్పబుద్ధివానికధికారమిచ్చిన
దొడ్డవారినెల్ల తొలగగొట్టు
చెప్పుదినెడు కుక్క చెరకు తీపెరుగునా
విశ్వదాభిరామ వినుర వేమ" ,

@"పట్టుపట్టరాదు పట్టివిడువరాదు
పట్టెనేని బిగియ పట్టవలయు
పట్టువిడుటకన్న పడిచచ్చుటేమేలు
విశ్వదాభిరామ వినురవేమ" ,

@"తుమ్మచెట్టు ముండ్ల తోడనేపుట్టును
విత్తులొననుండు వెడలునట్లు
మూర్ఖునకును బుద్ధి ముందుగా బుట్టను
విశ్వదాభిరామ వినురవేమ" ,

@"కపటి వేషమూని కడగండ్లు పడనేల
విపిన భూమి తిరిగి విసుగనేల
యుపముతోనే ముక్తి ఉన్నది చూడరా
విశ్వదాభి రామ వినుర వేమ" ,

@"అనువుగాని చోట అధికులమనరాదు
కొంచెముందుటెల్ల కొదువకాదు
కొండ యద్దమందు కొంచమై ఉండదా
విశ్వదాభిరామ వినురవేమ" ,

@"మనసులోనున్న మర్మమంత ఎరిగి
స్థిరము చేసి ఆత్మ తేటపరిచి
ఘటము నిల్పవలయు, ఘనతలింకేటికి
విశ్వదాభి రామవినురవేమ" ,

@"కదలనీయకుండ గట్టిగా లింగంబు
కట్టివేయనేమి ఘనత కలుగు
భావమందు శివుని భావించి కానరా
విశ్వదాభిరామ వినురవేమ" ,

@"మేక జంకబెట్టిమెలగుచు మందలో
బ్రమని తిరుగు గొల్ల పగిదిగాను
దేవునెరుగక పరదవేతల దలచు
విశ్వదాభిరామ వినురవేమ" ,

@"తన కుల గోత్రము లాకృతి
తన సంపద కలిమి బలిమి తనకేలనయా?
తన వెంటరావు నిజమిది
తన సత్యమే తోడువచ్చు తనతో
విశ్వదాభిరామ వినురవేమ" ,

@"కలిమిగల్గనేమి కరుణ లేకుండిన
కలిమి తగునె దుష్టకర్ములకును
తేనెగూర్పనీగ తెరువున బోవదా
విశ్వదాభిరామ వినురవేమ" ,

@"ఎండిన మానొకటడవిని
మండిన నందగ్ని పుట్టి యూడ్చును చెట్లన్‌
దండిగల వంశమెల్లను
చండాలుండొకడు పుట్టి చదువును వేమా" ,

@"కనులు పోవువాడు కాళ్లు పోయినవాడు
ఉభయులరయుగూడి యుండినట్లు
పేద పేద గూడి పెనగొని యుండును
విశ్వదాభిరామా వినురవేమ" ,

@"మాటలాడు గల్గు మర్మములెరిగిన
పిన్నపెద్దతనము లెన్నవలదు
పిన్నచేతి దివ్వె పెద్దగా వెలగదా?
విశ్వధాభిరామ వినురవేమ" ,

@"కొండముచ్చు పెండ్లికి కోతి పేరంటాలు
మొండి వాని హితుడు బండవాడు
దుండగీడునకును కొండెడు దళవాయి
విశ్వదాభిరామా వినురవేమ" ,

@"ఝుషము నీరు వెడల జచ్చుటే సిద్ధము
నీటనుండనేని నిక్కిపడును
అండతొలుగు నెడల నందర పని అట్లే
విశ్వదాభి రామ వినురవేమ" ,

@"తల్లియేడ్వ వినక తనయాలు వగచిన
జాలిపడెడు వాడు జడుడు సుమ్మి
తారతమ్య మెరుగనేరని పశువది
విశ్వదాభిరామ వినురవేమ" ,

@"పరులమేలు చూసి పలుకాకి వలె
వట్టిమాటలాడు వాడు అధముడు
అట్టివాని బతుకుటదిఏల మంటికా?
విశ్వదాభిరామ వినురవేమ" ,

@"గంగి గోవుపాలు గరిటడైనను చాలు
కడవెడైనను నేమి ఖరముపాలు
భక్తికల్గుకూడు పట్టెడైనను చాలు
విశ్వదాభిరామ వినురవేమ" ,

@"చిక్కియున్నవేళ సింహంబునైనను
బక్క కుక్కయైనా బాధసేయు
బలిమిలేని వేళ పంతములు చెల్లవు
విశ్వదాభిరామ వినురవేమ" ,

@"పనసతొనలకన్న పంచదారలకన్న
జుంటితేనెకన్న జున్నుకన్న
చెఱుకు రసముకన్న చెలుల మాటలె తీపి
విశ్వదాభిరామ వినురవేమ" ,

@"నిండునదులు పారు నిలచి గంభీరమై
వెఱ్రివాగు పాఱు వేగబొర్లి
అల్పుడాడురీతి నధికుండు నాడునా
విశ్వదాభిరామ వినురవేమ" ,

@"ఉప్పులేనికూర యొప్పదు రుచులకు
పప్పులేని తిండి ఫలములేదు
అప్పులేనివాడె యధిక సంపన్నుడు
విశ్వదాభిరామ వినురవేమ" ,

@"పసుల వన్నె వేరు పాలెల్ల ఒక్కటి
పుష్పజాతి వేరు పూజ ఒకటి
దర్శనంబులారు దైవంబు ఒక్కటి
విశ్వదాభిరామ వినురవేమ" ,

@"చంపదగిన శతృవు తనచేత
చిక్కెనేని కీడు చేయరాదు
పొసగ మేలు చేసి పొమ్మనుటే మేలు
విశ్వదాభిరామ వినురవేమ" ,

@"ఆపదగల వేళ అరసి బంధువు జూడు
భయము వేళ జూడు బంటుతనము
పేదవేళ జూడు పెండ్లాము గుణము
విశ్వదాభిరామ వినురవేమ" ,

@"ఉప్పు కప్పురంబు ఒక్క పోలికనుండు
చూడ చూడ రుచుల జాడ వేరు
పురుషులందు పుణ్య పురుషులు వేరయ
విశ్వదాభిరామ వినురవేమ!" ,

@"ఆత్మ శుద్ది లేని యాచారమదియేల
భాండశుద్ది లేని పాక మేల
చిత్తశుద్దిలేని శివపూజలేలరా
విశ్వదాభిరామ వినురవేమ!" ,

@"యినుము విరగనేని యినుమూరు ముమ్మారు
కాచియెతకవచ్చు గ్రమము గాను
మనసు విరిగెనేని మరి చేర్ఛరాదయా
విశ్వదాభిరామ వినురవేమ!" ,

@"కుండ కుంభమన్న కొండ పర్వతమన్న
నుప్పు లవణమన్న నొకటి కాదె
భాష లిట్టె వేరు పరతత్వమొకటె
విశ్వదాభిరామ వినురవేమ!" ,

@"అనగ ననగ రాగ మతిశ యిల్లుచునుండు
దినగ దినగ వేము తియ్యనుండు
సాధనమున పనులు సమకూరు ధరలోన
విశ్వదాభిరామ వినురవేమ!" ,

@"చెప్పులోని రాయి చెవిలోని జోరీగ
కంటిలోని నలుసు కాలి ముల్లు
ఇంటిలోని పోరు నింతింత గాదయా
విశ్వదాభిరామ వినురవేమ!" ,

@"తప్పు లెన్నువారు తండోప తండంబు
లుర్వి జనులకెల్ల నుండు తప్పు
తప్పు లెన్నువారు తమ తప్పులెరుగరు
విశ్వదాభిరామ వినురవేమ!" ,

@"మిరప గింజ చూడ మీద నల్లగనుండు
కొరికి జూడలోన జురుకుమనును
సజ్జను లగు వారి సార మిట్లుండు
విశ్వదాభిరామ వినురవేమ!" ,

@"మేడిపండు చూడ మేలిమై యుండును
పొట్టవిచ్చి చూడ పురుగులుండు
పిరికివాని మదిని బింకమీలాగురా
విశ్వదాభిరామ వినురవేమ!" ,

@"వేరు పురుగు చేరి వృక్షంబు జెరుచును
చీడపురుగు చేరి చెట్టు జెరచు
కుత్సితుండు చేరి గుణవంతు జెరచురా
విశ్వదాభిరామ వినురవేమ!" ,

@"వేషభాష లెరిగి కాషయవస్త్రముల్
గట్టగానె ముక్తి గలుగబోదు
తలలు బోడులృన తలపులూ బోడూలా
విశ్వదాభిరామ వినురవేమ!" ,
				};

			}
		}
	}
}