//---------------------------------------------------------------------------------------------
// <copyright file="R21.cs" company="Chandam-ఛందం">
//    Copyright © 2013 - 2018 'Chandam-ఛందం' : http://chandam.apphb.com
//    Original Author : Dileep Miriyala (m.dileep@gmail.com)
//    Last Updated    : 03-Feb-2018 21:28EST
//    Revisions:
//       Version    | Author                   | Email                     | Remarks
//       1.0        | Dileep Miriyala          | m.dileep@gmail.com        | Initial Commit
//       _._        | <TODO>                   |   <TODO>                  | <TODO>
// </copyright>
//---------------------------------------------------------------------------------------------

namespace Chandam.Rules.Rare
{
	public class laaTeeviTamu : Rule
	{
		public laaTeeviTamu()
		{
			Lines = 4;
			Threshold = 3;

			RuleType = RuleType.Name;
			PadyamType = PadyamType.Vruttam;
			PadyamSubType = PadyamSubType.Vruttam;
			YatiMode = YatiMode.CharPosition;


			Prasa = true;
			PrasaYati = false;

			Rules = new string[][] { "స,స,స,స,మ,త,య".Split(',') };
			Yati = new int[][] { new int[] { 13 } };


			Identifier = "laaTeeviTamu";
			Name = "లాటీవిటము";
			Examples = new string[] {
										"సగణంబులునాల్గిటిపై మతయల్‌ సమ్యగ్భావంబై యరుదేరన్‌\nబగలింటికి నేలిక యెవ్వఁడు నా భావింపంగా భాసురభంగిన్‌\nమిగులన్మధురంబగు శబ్దములన్‌ విశ్రాంతిన్‌ లాటీవిటవృత్తం\nబగు నిందుకళాధరసన్నుతనామాంకా శంకాంతంక విదారీ!",
										"అవునిల్లలుకంగబె పండువుకాదంభోదోద్యద్రాక్షసరాజుల్\nవివృతాననులుద్యతబాహులుపృధ్వీఘోషాపర్యాప్తభుజోగుల్\nదవులంజనుదెంతురుమీదగునీదర్పావేశాధఃకృతిబధ్ధుల్\nనవలాచెవులున్ మునినాసికయున్ నధ్ధంపెట్టంబండవు ప్రజ్ఞల్"
									};
		}
	}
	public class karibRMhitamu : Rule
	{
		public karibRMhitamu()
		{
			Lines = 4;
			Threshold = 3;

			RuleType = RuleType.Name;
			PadyamType = PadyamType.Vruttam;
			PadyamSubType = PadyamSubType.Vruttam;
			YatiMode = YatiMode.CharPosition;

			Prasa = true;
			PrasaYati = false;

			Rules = new string[][] { "భ,న,భ,న,భ,న,ర".Split(',') };
			Yati = new int[][] { new int[] { 13 } };

			Identifier = "karibRMhitamu";
			Name = "కరిబృంహితము";
			Examples = new string[] { "మూఁడు భనములు రేఫమును బదుమూఁట విరతియు సొంపుగాఁ\nగూడుకొనఁ గరిబృంహితము సమకూర్చి వసుమతిమండలా\nపీడ మను కరిబృంహితరవము పెల్లుగఁ బలుకుచుండఁగాఁ\nగోడిగపుఁ జిననాఁడు శకటునిఁ గూల్చిన హరి నుతించెదన్.",
										"ఉత్తరదిశకుఁబోయితి హిమవ దుర్విధరమునవాలియై\nకత్తళమనుచుఁబోయిపరుగునఁ గ్రౌంచగిరిపయివాలియై\nజొత్తిలనడుగుదోయితుదికొససోమగిరిపయివాలియై\nతత్తరపడుచువేరుదెసమదితట్టకముడుగుచుండఁగా."
									};
		}
	}

	public class chaMpakamaala : Rule
	{
		public chaMpakamaala()
		{
			Lines = 4;
			Threshold = 3;

			Identifier = "chaMpakamaala";
			Name = "చంపకమాల (సరసీ)";
			Examples = new string[]{
									"పదముల బట్టినం దలకుబా టొకయింతయు లేక శూరతన్\nమదగజవల్లభుండు మతిమంతుడు దంతయుగాంతఘట్టనం\nజెదరగ జిమ్మె నమ్మకరిచిప్పలు పాదులు దప్పనొప్పఱన్\nవదలి జలగ్రహంబు కరివాలముమూలము జీరె గోఱలన్" ,
									"అటజనికాంచెభూమిసురుడంబరచుంభిశిరస్సరజ్ఝరీ\nపటలముహుర్ముహుర్ లుఠదభంగతరంగమృదంగనిశ్వన\nస్ఫుటనటనానుకూల పరిపుల్ల కలాపకలాపిజాలమున్\nఘటకచరత్కరేణుకరకంపితసారముశీతసైలమున్",
									"అలసులు మందబుద్ధియుతు లల్పతరాయువు లుగ్రరోగసం\nకలితులు మందభాగ్యులు సుకర్మము లెవ్వియుఁ జేయఁజాల రీ\nకలియుగమందు మానవులు గావున నెయ్యది సర్వసౌఖ్యమై\nయలవడు? నేమిటం బొడము నాత్మకు? శాంతి మునీంద్ర! చెప్పవే.",
									"జననము లేక కర్మముల జాడలఁ బోక సమస్త చిత్త వ\nర్తనుఁడగు చక్రికిం గవు లుదార పదంబుల జన్మకర్మముల్\nవినుతులు సేయుచుండుదురు వేదరహస్యములందు నెందుఁ జూ\nచిన మఱి లేవు జీవునికిఁ జెప్పిన కైవడి జన్మకర్మముల్.",
									"జగదధినాథుఁడైన హరిసంతతలీలలు నామరూపముల్\nదగిలి మనోవచోగతులఁ దార్కికచాతురి యెంత గల్గినన్\nమిగిలి కుతర్కవాది తగ మేరలు సేసి యెఱుంగ నేర్చునే?\nయగణిత నర్తనక్రమము నజ్ఞుఁ డెఱింగి నుతింప నోపునే?",
									"తన కులధర్మమున్ విడిచి దానవవైరి పదారవిందముల్\nపనిపడి సేవసేసి పరిపాకము వొందక యెవ్వఁడేనిఁ జ\nచ్చిన మఱు మేన నైన నది సిద్ధి వహించుఁ దదీయ సేవఁ బా\nసినఁ గుల ధర్మగౌరవము సిద్ధి వహించునె యెన్ని మేనులన్. ",
									"త్రిభువనవంద్య గోపయువతీజనసంచితభాగధేయ రుక్‌\nప్రభవసముత్కరోజ్జ్వల శిరస్స్థిత రత్న మరీచి మంజరీ\nవిభవ సముజ్జ్వలత్పదరవింద ముకుంద యనంగ నొప్పునా\nజభములు జాజరేఫములుఁ జంపకమాల కగున్‌ దిశాయతిన్‌."
									};


			RuleType = RuleType.Name;
			PadyamType = PadyamType.Vruttam;
			PadyamSubType = PadyamSubType.Vruttam;
			YatiMode = YatiMode.CharPosition;
			Frequency = Frequency.Frequent;

			Rules = new string[][] { "న జ భ జ జ జ ర".Split(' ') };
			Yati = new int[][] { new int[] { 11 } };


			Prasa = true;
			PrasaYati = false;
		}
	}

	public class maNimaala : Rule
	{
		public maNimaala()
		{
			Lines = 4;
			Threshold = 3;

			RuleType = RuleType.Name;
			PadyamType = PadyamType.Vruttam;
			YatiMode = YatiMode.CharPosition;


			Prasa = true;
			PrasaYati = false;
			Rules = new string[][] { "స,జ,స,జ,స,జ,స".Split(',') };

			Yati = new int[][] { new int[] { 11 } };

			PadyamSubType = PadyamSubType.Vruttam;
			Identifier = "maNimaala";
			Name = "మణిమాల-2";
			Examples = new string[] {
										"శరణాగతార్తిహరణాంబుజాతదళసన్నిభాంబకయుగా\nకరుణాసముద్ర జగదాదికారుణ పురాణమూర్తి యనుచున్‌\nవరుసన్‌ సజత్రితయమున్‌ ద్రివారమొనరున్‌ సకారము తుదిన్‌\nదిరమొంద దిగ్యతిఁ గవుల్నుతింప మణిమాలవృత్త మమరున్‌.",
										"కదియంగమూఁడుసజముల్ సకారయుతమై దిశాఖ్యయతిగా\nమదినానుకారి నిఖిలాగమజ్ఞమణిమాలయండ్రుసుకవుల్ \nకదియంగమూఁడుసజముల్ సకారయుతమై దిశాఖ్యయతిగా\nమదినానుకారి నిఖిలాగమజ్ఞమణిమాలయండ్రుసుకవుల్ "
									};
		}
	}
	public class vanamaMjari : Rule
	{
		public vanamaMjari()
		{
			Lines = 4;
			Threshold = 3;

			RuleType = RuleType.Name;
			PadyamType = PadyamType.Vruttam;
			PadyamSubType = PadyamSubType.Vruttam;
			YatiMode = YatiMode.CharPosition;


			Prasa = true;
			PrasaYati = false;

			Rules = new string[][] { "న,జ,జ,జ,జ,భ,ర".Split(',') };
			Yati = new int[][] { new int[] { 14 } };


			Identifier = "vanamaMjari";
			Name = "వనమంజరి";
			Examples = new string[] {
										"హరి పురుషోత్తమ కృష్ణ కృపానిధి యాదిమూలమ యంచు నా\nకరిపతి పల్కఁగఁ గాచె నితం డని కౌతుకంబునఁ బల్మరున్‌\nజరగుఁ ద్రయోదశవిశ్రమముల్‌ నజజాజభాంచితరేఫలన్‌\nమరుగురునిం బ్రణుతింతు రిలన్‌ వనమంజరిం గవిపుంగవుల్‌.",
										 "నయుత జకార చతుష్కభరేఫగణత్రయేదశ విశ్రమా\nశ్రయమగు నవ్వనమంజరి రేచన సర్వశాస్త్ర విశారదా\nనయుత జకార చతుష్కభరేఫగణత్రయేదశ విశ్రమా\nశ్రయమగు నవ్వనమంజరి రేచన సర్వశాస్త్ర విశారదా"
									};
		}
	}

	public class sragdhara : Rule
	{
		public sragdhara()
		{
			Lines = 4;
			Threshold = 3;

			References = new string[] { "http://kandishankaraiah.blogspot.in/2012/10/27.html" };
			Identifier = "sragdhara";
			Name = "స్రగ్ధర";
			Examples = new string[] {
										"కూలున్ గుఱ్ఱంబులేనుంగులు ధరఁ గెడయుం గుప్పలై; నుగ్గునూచై\nవ్రాలున్దేరుల్‌ హతంబై వడిఁబడు సుభటవ్రాతముల్‌; శోణితంబుల్‌\nగ్రోలున్, మాంసంబు నంజుంగొఱకు, నెముకలన్గుంపులై సోలుచున్ భే\nతాలక్రవ్యాదభూతోత్కరములు; జతలై తాళముల్‌ దట్టి యాడున్.",
										"సేవించెన్ రంగధామున్ శ్రితనివహపయస్సింధుసంపూర్ణసోముం\nగావేరీ మధ్యసీమున్ ఘనకలుష మహాకాలకూటోగ్ర భీమున్\nదేవారిశ్రీవిరామున్ దివిజవినుత సందీపితానంత నామున్\nధీవిజ్ఞానాభిరాముం ద్రిభువన విలసద్దేవతా సార్వభౌమున్. ",
										"దండిం గోదండ కాండోద్ధత రథ హయ వేదండ దండంబుతోడన్\nదండెత్తెన్ మెండుగా నద్దనుజనికరముల్ దైవవర్గంబు మీఁదం\nజండబ్రహ్మాండభే దోచ్ఛ్రయ జయరవముల్ సర్వదిక్ క్షోభగా ను\nద్దండప్రఖ్యాతలీలం దలపడిరి సురల్ దర్పులై వారితోడన్.",
										"నా సామర్థ్యం బసామాన్యము త్రిజగములన్ గాంచె నెంతే ప్రశస్తిన్\nనా సాటెవ్వారు హా హా నరులును గపు లీనాడు నన్ గాంచుడంచున్\nజేసెన్ నాదంబు దిక్కుల్ చెదరెడు నటులన్ జెట్టి యింద్రారి బల్మిన్\nవేసెన్ బ్రహ్మాస్త్రమంతన్ వివిధ కపులపై భీకరంబైన రీతిన్ ",
										"శ్రీవాణీ! నిన్ను పూజించి మనెదను సదా సేవ నే జేతునమ్మా!\nభావమ్మందుంచి యర్చింప దలచెద రమా పార్వతీ తోడ, రమ్మా!\nదేవీ! నీ నామమందే దృఢమయిన గతిన్ తీవ్ర విశ్వాసముంతున్.\nనా విశ్వాసమ్ము లోనున్న పదములవి వీణాధరీ నీవె నమ్మా! ",
										"వాణీ! బ్రహ్మాణి! విద్యా! వనజభవ ముఖాబ్జాత దివ్యాసనస్థా!\nవీణాపాణీ! సువేణీ! విమల గుణగణా! వేదమాతా! శుభాంగీ!\nఏణీనేత్రా! పవిత్రా! హిమకరవదనా! ఈప్సితార్థప్రదాత్రీ!\nక్షోణిన్ నే వ్రాలి నీ యంఘ్రుల కివె నతులన్ గూర్తు నో కీరపాణీ!",
										"తెల్లంబై శైలవిశ్రాంతిని మునియతినిం దేజరిల్లున్‌ దృఢంబై\nచెల్లెం బెల్లై మకారాంచిత రభనయయల్‌ చెంద మీఁదన్‌ యకారం\nబుల్లం బారన్‌ బుధారాధ్యు నురగశయనున్‌ యోగివంద్యుం గడున్‌ రం\nజిల్లం జేయం గవీంద్రుల్‌ జితదనుజగురం జెప్పుదుర్‌ స్రగ్ధరాఖ్యన్‌.",
									 };




			PadyamType = PadyamType.Vruttam;
			PadyamSubType = PadyamSubType.Vruttam;
			RuleType = RuleType.Name;
			YatiMode = YatiMode.CharPosition;


			Prasa = true;
			PrasaYati = false;

			Rules = new string[][] { "మ ర భ న య య య".Split(' ') };
			Yati = new int[][] { new int[] { 8, 15 } };
		}
	}
}
