//---------------------------------------------------------------------------------------------
// <copyright file="MSeries.cs" company="Chandam-ఛందం">
//    Copyright © 2013 - 2018 'Chandam-ఛందం' : http://chandam.apphb.com
//    Original Author : Dileep Miriyala (m.dileep@gmail.com)
//    Last Updated    : 03-Feb-2018 21:33EST
//    Revisions:
//       Version    | Author                   | Email                     | Remarks
//       1.0        | Dileep Miriyala          | m.dileep@gmail.com        | Initial Commit
//       _._        | <TODO>                   |   <TODO>                  | <TODO>
// </copyright>
//---------------------------------------------------------------------------------------------

using System;
using System.Diagnostics;

namespace Research
{
	public class MatraSeries
	{
		private int _Sequence;
		private string _Sreni;
		public int Sequence
		{
			get
			{
				return _Sequence;
			}
			set
			{
				_Sequence = value;
			}
		}
		public string Sreni
		{
			get
			{
				return _Sreni;
			}
			set
			{
				_Sreni = value;
			}
		}
		public bool IsAvailable
		{
			get
			{
				return (_Sreni != "");
			}

		}
	}
	public class MSeries
	{
		public void Go()
		{

			char[] items = " IIUIUIII UIIUIIUIUIU".Replace(" ", "").ToCharArray();

			bool[] V = new bool[items.Length];
			int tot = TotLength(items);
			Debug.WriteLine("Total Length: " + tot);
			for (int i = 0; i < items.Length; i++)
			{
				V[i] = CanSplit(items, i + 1);


				if (V[i])
				{
					string series = BuildSeries(items, i + 1);
					Debug.WriteLine((i + 1).ToString().PadLeft(2, ' ') + " - " + series);
				}

			}
		}

		private int TotLength(char[] items)
		{
			int tot = 0;
			for (int i = 0; i < items.Length; i++)
			{
				tot = tot + ToInt(items[i]);
			}
			return tot;
		}

		private string BuildSeries(char[] items, int target)
		{
			string s = "";
			int tot = 0;
			for (int i = 0; i < items.Length; i++)
			{
				if (tot > target)
				{
					throw new Exception("...");
				}
				if (tot == target)
				{
					tot = 0;
					s = s + "-";
				}
				tot = tot + ToInt(items[i]);
				s = s + items[i];
			}

			if (tot > target)
			{
				throw new Exception("...");
			}
			return s;
		}

		private int ToInt(char p)
		{
			return p == 'I' ? 1 : 2;
		}

		private bool CanSplit(char[] items, int n)
		{
			int[] iItems = new int[items.Length];

			for (int i = 0; i < items.Length; i++)
			{
				iItems[i] = ToInt(items[i]);
			}

			return CanSplit(iItems, n);
		}



		private bool CanSplit(int[] items, int target)
		{
			int tot = 0;
			for (int i = 0; i < items.Length; i++)
			{
				if (tot > target)
				{
					return false;
				}
				if (tot == target)
				{
					tot = 0;
				}
				tot = tot + items[i];
			}
			return true;
		}
	}
}
//అపరాజిత (పరాజిత);14; శక్వరి; 5824; IIII IIUI UII UIU; న-న-ర-స-ల-గ; 9
//అలసగతి ;15; అతిశక్వరి ;7648 ; IIIII UIII UIII UU; న-స-న-భ-య; 10
//అభినవతామరస (కమలవిలాసిని, తామరస, లలితపద, తోదక, తోవక, దోధక, కలరవ) ;12; జగతి ;4896; – IIII UII UII UU;న-జ-జ-య ;8
//అశ్వగతి (అశ్వాక్రాంత, పద్మముఖీ, సంగత); 16 ;అష్టి ;28087 ; UII UII UII UII UII U; భ-భ-భ-భ-భ-గ; 10
//ఇంద్రవజ్ర ;11; త్రిష్టుప్ ;357 ; UUI UU IIUI UU; త-త-జ-గ-గ ;8
//ఉత్పలమాల ;20; కృతి ;355799; UIIUIUIII UIIUIIUIUIU; భ-ర-న-భ-భ-ర-ల-గ ;10
//ఉపేంద్రవజ్ర; 11; త్రిష్టుప్; 358 ; IUI UU IIUI UU; జ-త-జ-గ-గ 8
//కమలవిలసిత (సురుచిర, ఉపచిత్ర, సుపవిత్ర) ;14 ;శక్వరి; 4096 ; IIII IIII IIII UU; న-న-న-న-గ-గ ;9
//కమలాకర; 15; అతిశక్వరి ;7033 ; IIUII IIUII UII UU; స-న-జ-జ-య; 11 ;*
//కల్యాణ ;26; ఉత్కృతి; 2184355 ; UIUIUII UIUIU IUIUIUIIU UIUIU; ర-జ-జ-ర-జ-ర-స-ర-ల-గ; 8,13,22 *
//కరిబృంహిత ;21 ;ప్రకృతి; 782271 ; UI IIII UI IIII UI IIII UIU; భ-న-భ-న-భ-న-ర; 13
//కవికంఠభూషణ (కవికంఠవిభూషణ) ;19 ;అతిధృతి ;177900 ; IIUIUIII UIIUIIUIUIU; స-జ-స-స-స-జ-గ; 9
//కవిరాజవిరాజితము (హంసగతి, మహాతరుణీదయిత); 23 ;వికృతి ;3595120 ; IIII UII UII UII UII UII UII U ;న-జ-జ-జ-జ-జ-జ-ల-గ ;8,14,20
//కాంతి (కలికాంత, కాంత, గీతాలంబన, మోటక, మోటనక); 11; త్రిష్టుప్; 877 ; UU IIU IIU IIU; త-జ-జ-ల-గ; 8
//కుసుమలతావేల్లిత (చంద్రలేఖా, చిత్రలేఖా) ;18 ;ధృతి; 37857 ; UUUUU IIIIIU UIUUIUU ;మ-త-న-య-య-య ;12
//కుసుమవిచిత్ర (గజలలిత) ;12 ;జగతి; 976 ; IIII UU IIII UU ;న-య-న-య ;7
//క్రౌంచపద (తెలుగు) ;24 ;సంకృతి; 4193479 ; UII UU UII UU IIII IIII IIII UU; భ-మ-స-భ-న-న-న-య; 11, 19; ప్రాసయతి (1,5)
//క్షితి; 1; శ్రీ ;2 ;– I; ల
//గణనాథ ;12 ;జగతి; 911; – UIII UU UIII UU; భ-య-భ-య ;7 *
//గాయక ;23 ;వికృతి; 1794927 ;UIIIUIIU IIUU UIIUIIU IIUU ;భ-జ-జ-య-భ-భ-భ-గ-గ 9,13;20 *
//గౌరీ (చంచలాక్షీ, ప్రముదితవదనా, మందాకినీ, ప్రభ, ప్రభాత) ;12 ;జగతి ;1216 ;IIII IIU IU UIU; న-న-ర-ర ;8
//చంద్రమౌళి ;6 ;గాయత్రి ;11 ; UIU IUU; ర-య *
//చంద్రవదన (కామలతికా, కామలలితా); 6; గాయత్రి ;15 ; UIII UU ;భ-య
//చంద్రశ్రీ ;15 ;అతిశక్వరి ;5058 ; IUUUU UIIII UUI UU; య-మ-న-య-య ;11 *
//చంద్రశేఖర ;15 ;అతిశక్వరి ;10928 ; IIIIUI UIUI UIUIU; న-జ-ర-జ-ర ;13 *
//చంద్రికా (అపరవక్త్ర, ప్రసభ, భద్రికా) ;11 ;త్రిష్టుప్ ;704 ; III III UI UI U; న-న-ర-ల-గ; 11
//చంపకమాల; 21 ;ప్రకృతి ;711600; IIIIUIUIII UIIUIIUIUIU ;న-జ-భ-జ-జ-జ-ర; 11
//జన (పుష్ప, మద, మధు, బలి); 2 ;అత్యుక్త ;4 ;– II; ల-ల
//జలద; 13 ;అతిజగతి; 3543 ; UII UIU III UIIU ; భ-ర-న-భ-గ ;10
//జలధరమాలా (కాంతోత్పీడా); 12; జగతి ;241 ; UUU UIIII UUUU; మ-భ-స-మ; 9
//జాగ్రత్; 17; అత్యష్టి ;28540 ; IIUII IIUII IIUII UU; స-న-జ-న-భ-గ-గ ;11 *
//జ్ఞాన; 16; అష్టి ;15805 ; UUII IIUII UIIII UU ;త-న-భ-భ-స-గ; 10 *
//డమరుక ;16; అష్టి ;30564 ; IIUUUIIU IIIUIIIU; స-త-జ-స-న-గ ;9 *
//డిండిమ ;15; అతిశక్వరి; 11230 ; IUI IIU IIII UIUIU ;జ-స-న-జ-ర ;11 *
//తనుమధ్యా; 6; గాయత్రి; 13 ; UU IIU U; త-య;
//తనుమధ్యమా; 18 ;ధృతి ;77378 ; IUUU UUI UUI IIUI UUIU; య-మ-య-న-ర-ర ;8,15; *
//తన్వీ; 24 ;సంకృతి ;4155367 ; UII UU IIII IIU UII UII IIII UU; భ-త-న-స-భ-భ-న-య; 13
//తరళ (ధ్రువకోకిల) ;19 ;అతిధృతి ;186040 ; III UII UI UII UI UII UIU ;న-భ-ర-స-జ-జ-గ; 12
//చంచల (చిత్రశోభ) ;16 ;అష్టి; 43691 ; UI UI UI UI UI UI UI UI ;ర-జ-ర-జ-ర-ల; 9
//తాండవజవ; 18 ;ధృతి ;63484 ; IIU IIII IIII UII IIU U; స-న-న-స-న-య; 12 *
//తారక; 17 ;అత్యష్టి ;31612 ; IIUII IIUII UIIII UU ;స-న-జ-జ-న-గ-గ; 11 *
//తుల్య-1 ;24 ;సంకృతి ;15978301 ; UU IIII UU IIII UU IIII UU IIII ;త-న-త-న-త-న-త-న ;7,13,19 *
//తుల్య-2 ;23 ;వికృతి; 3395380 ; IIU UII UU IIII UU IIII UU IIU ;స-భ-త-న-త-న-త-ల-గ; 13 *
//తోటక (ఛిత్తక, భ్రమరావళి, నందినీ); 12 ;జగతి ;1756 ; IIU IIU IIU IIU ;స-స-స-స; 9
//దేవ; 14 ;శక్వరి; 1639 ; UIIU UIIU UIIU UU; భ-త-య-స-గ-గ ;9 *
//దోదక (దోధక, తరంగక, బందు, భిత్తక, తోటక, తోదక); 11 ;త్రిష్టుప్; 439 ; UII UII UII UU; భ-భ-భ-గ-గ; 7
//ద్రుతవిలంబిత (సుందరీ, హరిణప్లుతా) ;12; జగతి ;1464 ; III UII UII UIU ;న-భ-భ-ర; 7
//నతి ;22 ;ఆకృతి; 2023015 ; UIIU UIIU UIIII UIIU IIIIU ;భ-త-య-న-జ-జ-న-గ ;9,15 *
//నలినీ (భ్రమరావళి, శ్రీ) ;15 ;అతిశక్వరి; 14044 ; IIU IIU IIU IIU IIU ;స-స-స-స-స; 10
//నవనందినీ ;14; శక్వరి ;3820; IIUI UIII UIII UU ;స-జ-స-న-గ-గ; 9
//నారాయణ; 8; అనుష్టుప్ ;163 ; UIU UUI UI ;ర-త-గ-ల *
//నిశా (నారాచ, నారాచక, మహామలికా, సింహవిక్రీడిత, వరదా ); 18 ;ధృతి; 74944 ; IIII IIUI UUI UUI UUI U; న-న-ర-ర-ర-ర 9
//పంక్తి (అక్షరోపపదా, అక్షరపంక్తి, కాంచనమాలా, కుంతలతన్వీ, భూతలతన్వీ, హంసా, సుందరి ) ;5 ;సుప్రతిష్ఠ ;7 ; UII UU ;భ-గ-గ
//పంచచామరము (నారాచ, మహోత్సవ );16 ;అష్టి ;21846 ; IUIU IUIU IUIU IUIU ;జ-ర-జ-ర-జ-గ ;10
//పద్మనాభ; 25 ;వికృతి; 1198373;UUIUUIUUIUUI UUIUUIUUIUU; త-త-త-త-త-త-త-గ-గ ;13
//పరమేశ ;14 ;శక్వరి ;3452;IIUI IIIUI UII UU ;స-న-జ-భ-గ-గ; 10 *
//పురుష ;9 ;బృహతి; 31-; UII IIU UU U ;భ-స-మ ;7 *
//పృథ్వి (ధృతి, విలంబితగతి) ;17 ;అత్యష్టి ;38750 ; IUII IUIU III UIUUIU; జ-స-జ-స-య-ల-గ ;9 లేక 12
//ప్రకృతి; 8 ;అనుష్టుప్; 52 ; IIUU IIUU; స-భ-గ-గ ;5 *
//ప్రభాకలిత ;19; అతిధృతి; 175472; – IIII UII UIUI IUI UIUIU; న-జ-జ-భ-ర-జ-గ ;13
//ప్రభాత (మృగేంద్రముఖ, సువక్త్రా, అచల); 13; అతిజగతి ;1392 ; IIII UII UIU IUU ;న-జ-జ-ర-గ 8
//ప్రభు ;26 ;ఉత్కృతి ;28761088 ; IIII IIII IIU IIU IIU IIU IIU IIU; న-న-న-జ-జ-జ-జ-జ-ల-గ; 9,15,21
//ప్రమితాక్షర ;12; జగతి; 1772 ; IIU IUI IIU IIU ;స-జ-స-స ;9
//ప్రహరణకలితా (కలికా); 14 ;శక్వరి ;8128 ; IIII IIU IIII IIU లేక III IIIU III IIIU ;న-న-భ-న-ల-గ; 8
//ప్రహర్షిణి (మయూరపిచ్ఛ) ;13; అతిజగతి; 1401 ; UU UII IIU IUI UU ;మ-న-జ-ర-గ; 8
//ప్రియంవదా (మత్తకోకిల); 12; జగతి ;1400 ; III UIII UI UIU ;న-భ-జ-ర; 8
//ప్రియకాంతా (కాంత); 16 ;అష్టి; 13264; – IIIIU UIIII UUII UU ;న-య-న-య-స-గ ;11
//ఫలసదన; 16 ;అష్టి; 16384 ; IIIII IIII IIIII UU; న-న-న-న-స-గ ;10
//బిల్వ; 6 ;గాయత్రి; 55 ; UII UII ;భ-భ *
//బ్రహ్మ (ద్వియోధా, స్రగ్విణీ, హంసమాలా );6; గాయత్రి; 19 ; UIU UIU ;ర-ర
//భాస్కరవిలసితము; 25; అభికృతి; 8381311 ; UII IIII UII UU UII IIII IIII UU ;భ-న-జ-య-భ-న-న-స-గ ;13
//భుజంగప్రయాతము (అప్రమేయా) ;12 ;జగతి ;586 ; IUU IUU IUU IUU ;య-య-య-య; 8
//భూతిలక ;19; అతిధృతి ;186039 ; UII UII UIU IIUI UII UIU ;భ-భ-ర-స-జ-జ-గ ;12
//భూనుత (లతా, వనలతా, వలనా); 14 ;శక్వరి; 3515 ; UIUI IIUII UII UU ;ర-న-భ-భ-గ-గ ;10
//భ్రమరవిలసిత ;11 ;త్రిష్టుప్ ;1009; UU UU IIII IIU ;మ-భ-న-ల-గ; 6
//మంగళమణి ;16; అష్టి ;31711 ; UIIII UIIII UIIII U; భ-స-న-జ-న-గ ;11 *
//మంగళమహాశ్రీ; 26 ;ఉత్కృతి; 15658735 ; UIII UIII UIII UIII UIII UIII UU; భ-జ-స-న-భ-జ-స-న-గ-గ; 9,17
//మంజుభాషిణి (కనకప్రభా, జయా, నందినీ, ప్రబోధితా, మనోవతీ, విలంబితా, సునందినీ, సుమంగలీ) ;13 ;అతిజగతి; 2796 ; IIUI UIII UIU IU; స-జ-స-జ-గ ;9
//మందాక్రాంత (శ్రీధరా) ;17 ;అత్యష్టి ;18929 ; UUUU IIIIIU UIUUIUU ;మ-భ-న-త-త-గ-గ ;11
//మణిదీప్తి ;19 ;అతిధృతి; 55513 ; UU UII UII UU UII UII UU U ;మ-స-స-త-జ-య-గ ;11 *
//మణిభూషణ (రమణీయక, సుందర, ఉత్సర, మణిభూషణశ్రీ); 15; అతిశక్వరి ;11707 ; UIUI IIUII UIIU IU; ర-న-భ-భ-ర; 10
//మణిమాలా (అబ్జవిచిత్రా, పుష్పవిచిత్రా); 12 ;జగతి ;781 ; UUII UU UUII UU లేక UUI IUU UUI IUU లేక UU IIUU UU IIUU; త-య-త-య ;7
//మత్తకీర; 20 ;కృతి ;372096 ; III IIII UI UII UI UII UIU; న-న-జ-భ-ర-స-ల-గ ;13 *
//మత్తకోకిల (చర్చరీ, మల్లికామాల, మాలికోత్తరమాలికా, విబుధప్రియా, హరనర్తన, ఉజ్జ్వల, హరిణప్లుత) ;18 ;ధృతి; 93019; UI UII UI UII UI UII UIU ;ర-స-జ-జ-భ-ర; 11
//మత్తమయూర (మాయా) ;13 ;అతిజగతి ;1633 ;UUUU UIIUU IIUU ;మ-త-య-స-గ ;8
//మత్తేభ (అశ్వధాటి); 22; ఆకృతి; 1915509 ; UUI UIII UUI UIII UUI UIII U; త-భ-య-జ-స-ర-న-గ ;8,15
//మత్తేభవిక్రీడితము; 20; కృతి ;298676 ; IIUUIIUIUIIIU UUIUUIU ;స-భ-ర-న-మ-య-ల-గ ;14
//మదనవిలసిత (ద్రుతగతి, చపలా, మధుమతి, లటహ, హరివిలసిత); 7; ఉష్ణిక్ ;64; IIII IIU; న-న-గ
//మనోహర; 13 ;అతిజగతి; 2731 ; UI UI UI UI UI UI U; ర-జ-ర-జ-గ; 9 *
//మహామంగళమణి; 15; అతిశక్వరి ;14020 ; IIUU UUII UIIU IIU ;స-మ-స-స-స; 9 *
//మహాస్రగ్ధర; 22;ఆకృతి ;605988 –; IIUUUIUU IIIIIIU UIUUIUU; స-త-త-న-స-ర-ర-గ; 9,16
//మానిని (మదిరా, లతాకుసుమ, సంగతా); 22 ;ఆకృతి; 1797559 ; UII UII UII UII UII UII UII U; భ-భ-భ-భ-భ-భ-భ-గురు ;7,13,19
//మాలిని (నాందీముఖీ); 15; అతిశక్వరి ;4672 ; III III UU UIUUI UU ;న-న-మ-య-య; 9
//మేఘవిలసిత ;12; జగతి ;2041 ; UU UII IIII IIU ;మ-న-న-స ;6
//మౌక్తికమాలా (కుట్మలదంతీ, రుచిరా, సాంద్రపద, భద్రపద) ;11 ;త్రిష్టుప్;487 ;– UII UU IIII UU ;భ-త-న-గ-గ ;7
//యశస్వి; 22 ;ఆకృతి ;450553 ; UU UII IIII IIII UII UII UU U ;మ-న-న-న-జ-జ-య-గ 6;14,20 *
//రథోద్ధత (పరాంతిక); 11 ;త్రిష్టుప్ ;699 ;UI UIII UI UIU; ర-న-ర-ల-గ ;7
//రుక్మవతి (చంపకమాలా, పుష్పసమృద్ధి, సుభావా);10 ;పంక్తి; 199 ; UII UU UII UU ;భ-మ-స-గ; 6
//రుచిర (కలావతీ, అతిరుచిరా, సదాగతి); 13 ;అతిజగతి ;2806 ;IUIU IIII UIUIU ;జ-భ-స-జ-గ ;9
//లక్ష్మీ; 22 ;ఆకృతి ;1047760 ; IIII UU IIU UII IIII IIII UU; న-య-స-భ-న-న-స-గ ;13 *
//లలిత (దయి); 4; ప్రతిష్ఠ; 16; IIII; న-ల
//వనమంజరి ;21 ;ప్రకృతి; 744304 ; IIII UII UII UII UIU IIUI U ;న-జ-జ-జ-జ-భ-ర; 14
//వనమయూర (ఇందువదనా); 14; శక్వరి; 3823;– UIII UIII UIII UU; భ-జ-స-న-గ-గ; 9
//వసంతతిలక (ఉద్ధర్షిణీ, ఔద్ధర్షిణి, కర్ణోత్పలా, మధుమాధవీ, శోభావతీ, సింహోన్నతా, సింహోద్ధతా) ;14 ;శక్వరి; 2933 ; UUIUIII UIIUIUU; త-భ-జ-జ-గ-గ ;8
//వసన (కమల, మహి) ;8; అనుష్టుప్ ;96 ; IIIII UIU; న-స-ల-గ
//వాణి ;19 ;అతిధృతి; 106225 ; UU UU IIII UII IIU UII UU ;మ-భ-స-న-య-స-గ ;16 *
//వామదేవ ;16 ;అష్టి ;21995; UIUI UIIII UIUI UIU ;ర-జ-న-ర-జ-గ; 10 *
//విద్యున్మాలా (విద్యుల్లేఖా) ;8; అనుష్టుప్ ;1 –; UUUU UUUU; మ-మ-గ-గ ;5
//శంకర-1; 15 ;అతిశక్వరి ;7135 ;– UIIII UIIII UIIU U; భ-స-న-జ-య 11 *
//శంకర-2; 16; అష్టి 3;0703 ; UIIII UIIII UIIII U; భ-జ-న-స-న-గ; 11 *
//శంభునటనము; 26; ఉత్కృతి ;31317470 ; IUIIIUIII UIIIUIII UIIIUIIIU; జ-స-న-భ-జ-స-న-భ-ల-గ; 10,18
//శతపత్ర (చారుమతి); 25 ;అభికృతి; 14872303 ; UIII UIII UIII UIII UIII UIII U; భ-జ-స-న-భ-జ-స-న-గ; 9,17
//శశివదనా (కనకలతా, చతురంశా, మకరశీర్షా, ముకులితా); 6; గాయత్రి; 16; – IIII UU; న-య
//శార్దూలవిక్రీడితము; 19; అతిధృతి; 149337 ;UUUIIUIUIIIU UUIUUIU ;మ-స-జ-స-త-త-గ ;13
//శిఖరిణి ;17; అత్యష్టి ;59330; IUU UUU III IIU UIIIU ;య-మ-న-స-భ-ల-గ ;13
//శివ; 6 ;గాయత్రి ;43 ;UI UI UI; ర-జ *
//శివశంకర (సురభి); 18; ధృతి ;126844 ; IIUII IIUII IIUII IIU; స-న-జ-న-భ-స; 11 *
//శోభనమహాశ్రీ ;25; అభికృతి ;14498421 ; UUI UIII UUI UIII UUI UIII UIIU ;త-భ-య-జ-స-ర-న-భ-గ; 8,15,22 *
//శ్రీ; 1; శ్రీ; 1 ; U; గ
//శ్రీకర; 13; అతిజగతి; 2732 ; IIUI UIUI UIUIU; స-జ-ర-జ-గ ;9 *
//శ్రీమతి ;17; అత్యష్టి ;22115 ; UIU UUII UUII UIUI UU ;ర-త-య-స-జ-గ-గ ;12 *
//సంజ్ఞా (కమలలోచనా, కమలాక్షీ, చండీ); 13 ;అతిజగతి ;1792 ; IIII IIII UII UU ;న-న-స-స-గ; 9
//సన్నుత; 15 ;అతిశక్వరి; 15851 ; UI UI UI III UI III U ;ర-జ-న-భ-స ;10 *
//సభా (గురుమధ్యా) ;6; గాయత్రి ;52 ; IIU UII; స-భ
//సరసిజ (మదలేఖా, విధువక్త్రా, సురుచిర); 7; ఉష్ణిక్;31 ; UII IIU U లేక UIII IUU ;భ-స-గ
//సలిల; 5; సుప్రతిష్ఠ ;28 ; IIUII; స-ల-ల *
//సాయం; 11; త్రిష్టుప్; 345 ; UU UII UIUI UU; మ-స-జ-గ-గ; 6 *
//సుకాంతి (జయా, నగానితా, నగణికా, లాసినీ, విలాసినీ) ;4 ;ప్రతిష్ఠ; 6 ;IU IU ;జ-గ
//సుగంధి (ఉత్సవ, ఉత్సాహ, చామర, తూణక, మహోత్సవ, శాలిని, ప్రశాంతి) ;15 ;అతిశక్వరి; 10923 ; UIUIUIUI UIUIUIU ;ర-జ-ర-జ-ర; 9
//సుభగ ;8 ;అనుష్టుప్ ;52 ;IIUU IIUU ;స-భ-గ-గ *
//సుముఖీ (ద్రుతపాదగతి) ;11; త్రిష్టుప్ ;880; – IIII UII UII U ;న-జ-జ-ల-గ; 7
//స్రగ్ధర ;21; ప్రకృతి; 302993 ; UUUUIUU IIIIIIU UIUUIUU ;మ-ర-భ-న-య-య-య ;8,14
//స్రగ్విణీ (లక్ష్మీధర, పద్మినీ); 12; జగతి ;1171 ; UIU UIU UIU UIU; ర-ర-ర-ర ;7
//స్వాగతము ;11 ;త్రిష్టుప్ ;443 ; UIUI IIUII UU ;ర-న-భ-గ-గ ;7
//సలిల; 5 ;సుప్రతిష్ఠ ;28 ; IIUII; స-ల-ల
//చంద్రమౌళి; 6 ;గాయత్రి; 11 ; UIU IUU; ర-య
//బిల్వ; 6 ;గాయత్రి ;55 ; UII UII; భ-భ
//శివ ;6 ;గాయత్రి; 43 ;– UI UI UI ;ర-జ
//సుభగ; 8; అనుష్టుప్; 52 ;– IIUU IIUU; స-భ-గ-గ ;5
//ప్రకృతి ;8 ;అనుష్టుప్; 52 ;– IIUU IIUU; స-భ-గ-గ ;5
//నారాయణ; 8; అనుష్టుప్; 163 ;– UIU UUI UI; ర-త-గ-ల;
//పురుష ;9 ;బృహతి ;31-; UII IIU UU U ;భ-స-మ; 7
//సాయం; 11; త్రిష్టుప్; 345;  UU UII UIUI UU ;మ-స-జ-గ-గ; 6
//గణనాథ ;12 ;జగతి ;911 ; UIII UU UIII UU; భ-య-భ-య; 7
//మనోహర ;13 ;అతిజగతి ;2731 ; UI UI UI UI UI UI U; ర-జ-ర-జ-గ ;9
//శ్రీకర; 13 ;అతిజగతి ;2732 ; IIUI UIUI UIUIU ;స-జ-ర-జ-గ ;9
//దేవ ;14; శక్వరి; 1639 ;– UIIU UIIU UIIU UU; భ-త-య-స-గ-గ; 9
//పరమేశ ;14; శక్వరి; 3452 ; IIUI IIIUI UII UU; స-న-జ-భ-గ-గ; 10
//చంద్రశ్రీ; 15; అతిశక్వరి ;5058 ;– IUUUU UIIII UUI UU ;య-మ-న-య-య ;11
//కమలాకర ;15 ;అతిశక్వరి ;7033 ; IIUII IIUII UII UU ;స-న-జ-జ-య ;11
//శంకర-1; 15 ;అతిశక్వరి ;7135 ; UIIII UIIII UIIU U; భ-స-న-జ-య ;11
//చంద్రశేఖర ;15; అతిశక్వరి; 10928 ; IIIIUI UIUI UIUIU ;న-జ-ర-జ-ర ;13
//డిండిమ ;15 ;అతిశక్వరి; 11230 ; IUI IIU IIII UIUIU ;జ-స-న-జ-ర; 11
//మహామంగళమణి ;15; అతిశక్వరి; 14020 ; IIUU UUII UIIU IIU ;స-మ-స-స-స ;9
//సన్నుత ;15 ;అతిశక్వరి ;15851 ; UI UI UI III UI III U ;ర-జ-న-భ-స ;10
//జ్ఞాన; 16; అష్టి; 15805 ; UUII IIUII UIIII UU ;త-న-భ-భ-స-గ; 10
//వామదేవ ;16; అష్టి ;21995 ; UIUI UIIII UIUI UIU ;ర-జ-న-ర-జ-గ; 10
//డమరుక; 16; అష్టి; 30564 ; IIUUUIIU IIIUIIIU ;స-త-జ-స-న-గ; 9
//శంకర-2; 16 ;అష్టి ;30703 ;UIIII UIIII UIIII U ;భ-జ-న-స-న-గ ;11
//మంగళమణి ;16 ;అష్టి ;31711 ; UIIII UIIII UIIII U; భ-స-న-జ-న-గ; 11
//శ్రీమతి; 17; అత్యష్టి ;22115 ; UIU UUII UUII UIUI UU; ర-త-య-స-జ-గ-గ ;12
//జాగ్రత్ ;17; అత్యష్టి ;28540 ; IIUII IIUII IIUII UU; స-న-జ-న-భ-గ-గ; 11
//తారక ;17 ;అత్యష్టి ;31612 ; IIUII IIUII UIIII UU; స-న-జ-జ-న-గ-గ; 11
//తాండవజవ ;18; ధృతి ;63484 ; IIU IIII IIII UII IIU U; స-న-న-స-న-య; 12
//తనుమధ్యమా; 18 ;ధృతి; 77378 ;IUUU UUI UUI IIUI UUIU ;య-మ-య-న-ర-ర; 8,15
//మణిదీప్తి ;19; అతిధృతి ;55513 ; UU UII UII UU UII UII UU U ;మ-స-స-త-జ-య-గ ;11
//వాణి ;19 ;అతిధృతి ;106225 ; UU UU IIII UII IIU UII UU ;మ-భ-స-న-య-స-గ ;13
//మత్తకీర; 20; కృతి; 372096 ; III IIII UI UII UI UII UIU ;న-న-జ-భ-ర-స-ల-గ; 13
//యశస్వి; 22; ఆకృతి; 450553 ; UU UII IIII IIII UII UII UU U ;మ-న-న-న-జ-జ-య-గ ;6,14,20
//లక్ష్మీ ;22 ;ఆకృతి; 1047760 ; IIII UU IIU UII IIII IIII UU ;న-య-స-భ-న-న-స-గ; 13
//నతి ;22; ఆకృతి ;2023015;UIIU UIIU UIIII UIIU IIIIU ;భ-త-య-న-జ-జ-న-గ ;9,15
//గాయక ;23; వికృతి ;1794927;UIIIUIIU IIUU UIIUIIU IIUU ;భ-జ-జ-య-భ-భ-భ-గ-గ ;9,13,20
//తుల్య-2 ;23 ;వికృతి; 3395380 ; IIU UII UU IIII UU IIII UU IIU; స-భ-త-న-త-న-త-ల-గ ;13 
//తుల్య-1; 24; సంకృతి ;15978301 ;UU IIII UU IIII UU IIII UU IIII ;త-న-త-న-త-న-త-న ;7,13,19
//శోభనమహాశ్రీ ;25; అభికృతి; 14498421 ; UUI UIII UUI UIII UUI UIII UIIU ;త-భ-య-జ-స-ర-న-భ-గ; 8,15,22
//కల్యాణ; 26; ఉత్కృతి; 2184355;UIUIUII UIUIU IUIUIUIIU UIUIU; ర-జ-జ-ర-జ-ర-స-ర-ల-గ ;8,13,22 
//---
//దండకము – చివర గురువుతో నున్న ఒక త-గణ దండకము
//పుష్పితాగ్రా ; IIIIUI UIUIUU / IIIIUII UIUIUU బేసిపాదము – న-జ-ర-య / సరిపాదము – న-జ-ల-ర-య
